{"cells":[{"cell_type":"markdown","metadata":{"id":"hU_Uc7uXH7d_"},"source":["# SAM 2024 : TP Requêtes multi-sources pour l'open data\n","\n","Séances 8 et 9\n","\n","date du document : 28/03/2024\n","\n","\n","## BOUZOURINE Hichem - 21319982\n","\n","Objectif : Comprendre et réaliser des jointures entre deux sources réelles distantes lorsque l'accès aux sources est conforme aux standards de l'*open data*.  \n","\n","Contexte : On considère deux sources réelles ainsi que des exemples de requêtes pouvant être posées sur chacune d'entre elles.\n","\n","On vous demande de mettre en oeuvre des scénarios de requêtes **MULTI** sources.\n","\n","Pour 2024 : Faire l'exercice 3 en priorité\n","\n","\n"]},{"cell_type":"markdown","metadata":{"id":"1Hr9i-Fg3EJZ"},"source":["## Préparation\n","\n","**Copier** ce notebook dans votre drive et l'exécuter dans l'environnement colab de google\n"]},{"cell_type":"code","execution_count":1,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":16037,"status":"ok","timestamp":1711657444836,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"jDf3fu9UHy7i","outputId":"7ad50b38-2f8c-4e13-a68d-09b64d076e54"},"outputs":[{"name":"stdout","output_type":"stream","text":["Defaulting to user installation because normal site-packages is not writeable\n","Requirement already satisfied: SPARQLWrapper in /home/hichem/.local/lib/python3.10/site-packages (2.0.0)\n","Requirement already satisfied: rdflib>=6.1.1 in /home/hichem/.local/lib/python3.10/site-packages (from SPARQLWrapper) (7.0.0)\n","Requirement already satisfied: isodate<0.7.0,>=0.6.0 in /home/hichem/.local/lib/python3.10/site-packages (from rdflib>=6.1.1->SPARQLWrapper) (0.6.1)\n","Requirement already satisfied: pyparsing<4,>=2.1.0 in /usr/lib/python3/dist-packages (from rdflib>=6.1.1->SPARQLWrapper) (2.4.7)\n","Requirement already satisfied: six in /usr/lib/python3/dist-packages (from isodate<0.7.0,>=0.6.0->rdflib>=6.1.1->SPARQLWrapper) (1.16.0)\n"]}],"source":["!pip install SPARQLWrapper"]},{"cell_type":"markdown","metadata":{"id":"U4iuSiRuvKgb"},"source":["### Manipuler le résultat d'une requête\n","Fonctions **tableauResultat** pour extraire  le résultat d'une requête"]},{"cell_type":"code","execution_count":2,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":375,"status":"ok","timestamp":1711657445207,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"-aXA-jUgDCKU","outputId":"28e6a6b0-ee64-4384-ec7c-a04a0c7a0802"},"outputs":[{"name":"stdout","output_type":"stream","text":["fonctions définies\n"]}],"source":["import pandas as pd\n","\n","#pd.set_option('max_columns', None)\n","pd.set_option('max_colwidth', None)\n","\n","# Déterminer la liste des noms d'attributs du résultat, en tenant compte des attributs optionnels.\n","def schemaResultat(resultats, limit=100):\n","  d = {}\n","  for elt in resultats[:limit]:\n","    for (pos, nom) in enumerate(elt):\n","      sum_pos, nb = d.get(nom, (0, 0))\n","      d[nom] = (sum_pos + pos, nb + 1)\n","  mean_pos_by_name = [(sum_pos / nb, nom) for (nom, (sum_pos, nb)) in d.items()]\n","  colonnes = [nom for (mean_pos, nom) in sorted(mean_pos_by_name)]\n","  return colonnes\n","\n","def tableauResultat(resultats, limit=100, colonnes=None):\n","  if colonnes is None :\n","    colonnes = schemaResultat(resultats, limit)\n","  tableau = []\n","  for elt in resultats[:limit]:\n","    row = {name:v.value for name, v in elt.items()}\n","    tableau.append([row.get(n, \"\") for n in colonnes])\n","  return tableau\n","\n","print (\"fonctions définies\")"]},{"cell_type":"markdown","metadata":{"id":"HwrY17qTKqx5"},"source":["Afficher le résultat"]},{"cell_type":"code","execution_count":3,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":10,"status":"ok","timestamp":1711657445207,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"5hh7i-9IKnuf","outputId":"735957ff-87d7-4485-b080-10895fb1e1ee"},"outputs":[{"name":"stdout","output_type":"stream","text":["fonctions définies\n"]}],"source":["def afficherResultat(resultats, limit=100):\n","  print(len(resultats), \"éléments\")\n","  colonnes = schemaResultat(resultats, limit)\n","  print(\"schéma: \", colonnes)\n","  result = tableauResultat(resultats, limit, colonnes)\n","  return pd.DataFrame(result, columns = colonnes)\n","\n","print (\"fonctions définies\")"]},{"cell_type":"markdown","metadata":{"id":"tfI9a4lklAKf"},"source":["### Importer le pilote pour accéder aux sources"]},{"cell_type":"code","execution_count":4,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":7,"status":"ok","timestamp":1711657445207,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"kFXKS-euk4T4","outputId":"0bf1bfe3-9884-4aed-8dec-f5913055ac0e"},"outputs":[{"name":"stdout","output_type":"stream","text":["pilote importé\n"]}],"source":["from SPARQLWrapper import SPARQLWrapper2\n","print(\"pilote importé\")"]},{"cell_type":"markdown","metadata":{"id":"wM0f7svUC2LE"},"source":["### Préparer l'accès à la source BNF"]},{"cell_type":"code","execution_count":5,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":7,"status":"ok","timestamp":1711657445208,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"0RziFSRYDBpE","outputId":"64ae9758-ae09-4d7c-df10-8a8fe5b5b6fc"},"outputs":[{"name":"stdout","output_type":"stream","text":["\n","PREFIX dc: <http://purl.org/dc/terms/>\n","PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n","\n","PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n","PREFIX rda: <http://rdaregistry.info/Elements/w/#>\n","PREFIX owl: <http://www.w3.org/2002/07/owl#>\n","\n","PREFIX bnf: <http://data.bnf.fr/ontology/bnf-onto/>\n","\n","PREFIX bio: <http://vocab.org/bio/0.1/>\n","PREFIX voc2: <http://rdvocab.info/ElementsGr2/>\n","\n"]}],"source":["# Connexion à la BNF\n","BNF = SPARQLWrapper2(\"http://data.bnf.fr/sparql\")\n","\n","BNF_prefix = \"\"\"\n","PREFIX dc: <http://purl.org/dc/terms/>\n","PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n","\n","PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n","PREFIX rda: <http://rdaregistry.info/Elements/w/#>\n","PREFIX owl: <http://www.w3.org/2002/07/owl#>\n","\n","PREFIX bnf: <http://data.bnf.fr/ontology/bnf-onto/>\n","\n","PREFIX bio: <http://vocab.org/bio/0.1/>\n","PREFIX voc2: <http://rdvocab.info/ElementsGr2/>\n","\"\"\"\n","print(BNF_prefix)"]},{"cell_type":"markdown","metadata":{"id":"IOLb2KSfDLdR"},"source":["### Préparer l'accès à la source DBPEDIA"]},{"cell_type":"code","execution_count":6,"metadata":{"id":"pIJSoRGDDLdR"},"outputs":[],"source":["# Connexion à DBPEDIA France.\n","DBPEDIA = SPARQLWrapper2(\"http://fr.dbpedia.org/sparql\")\n","\n","DBPEDIA_prefix =  \"\"\"\n","PREFIX dc:   <http://purl.org/dc/terms/>\n","PREFIX xsd:  <http://www.w3.org/2001/XMLSchema#>\n","\n","PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n","PREFIX rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n","PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n","\n","PREFIX dbo:  <http://dbpedia.org/ontology/>\n","\n","# Dans cette source, les noms de propriétés sont en français\n","PREFIX dbp:  <http://fr.dbpedia.org/property/>\n","\"\"\"\n","# print(DBPEDIA_prefix)"]},{"cell_type":"markdown","metadata":{"id":"FTXujqEYg-mv"},"source":["## Source 1 : La bibliothèque BNF"]},{"cell_type":"markdown","metadata":{"id":"TgJO3oVK40yT"},"source":["### BNF P1: Le nom des personnes\n","On suppose les relations :\n","*    **CrééPar**(ouvrage, auteur)\n","*    **Nom**(auteur, nom)\n","\n","En SQL, la requête s'exprimerait ainsi:\n","\n","> select distinct n.nom\n","\n","> from CrééPar c, Nom n\n","\n","> where c.auteur = n.auteur"]},{"cell_type":"code","execution_count":7,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":5827,"status":"ok","timestamp":1711657451272,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"W7NBgmGq5P_b","outputId":"2afa852e-8d9c-4eed-8eb1-0780ccc40a5c"},"outputs":[{"name":"stdout","output_type":"stream","text":["['Ahmed Ben Brihmat']\n","['Constantin Roussel']\n","['François-Marie-Stéphane Guillot']\n","['Paul Émilien Félix Defontaine']\n","['François Joseph Ferdinand Marchal']\n"]}],"source":["requete = BNF_prefix + \"\"\"\n","SELECT distinct ?nom\n","WHERE {\n","  ?ouvrage dc:creator ?auteur .       # un ouvrage est créé par au moins un auteur\n","  ?auteur foaf:name ?nom              # un auteur a un nom\n","}\n","LIMIT 5\n","\"\"\"\n","\n","BNF.setQuery(requete)\n","resultats = BNF.query().bindings\n","for r in tableauResultat(resultats):\n","  print(r)"]},{"cell_type":"markdown","metadata":{"id":"M0qSrFgKhHS2"},"source":["### BNF T1: liste de thèmes\n","#### Les *themes* des oeuvres dont l'auteur est référencé dans dbpedia france\n","\n","En SQL, cette requête pourrait s'exprimer sur les tables suivantes\n","\n","**créé_par** (livre, auteur)\n","\n","**type_d_expression** (livre, type_expre)  -- exple de tpye d'expression: textuelle\n","\n","**écrit_en** (livre, langue)\n","\n","**sujet** (livre, thème)\n","\n","**auteur_équivalent** (auteur, auteur_source2)\n","\n","et une condition SQL serait : WHERE auteur_source2 like 'http://fr.dbpedia.org%'"]},{"cell_type":"code","execution_count":8,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":711},"executionInfo":{"elapsed":2504,"status":"ok","timestamp":1711657453772,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"RI4C0Q9hhRe9","outputId":"4ab769dd-d007-47b6-dd21-c1f4cd3b2349"},"outputs":[{"name":"stdout","output_type":"stream","text":["20 éléments\n","schéma:  ['theme']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>theme</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Administration publique</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Anthropologie. Ethnologie</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Architecture</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Archéologie. Préhistoire. Histoire ancienne</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Art</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>Art et science militaires</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>Arts du spectacle</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Arts graphiques</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>Astronomie</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>Audiovisuel</td>\n","    </tr>\n","    <tr>\n","      <th>10</th>\n","      <td>Biologie</td>\n","    </tr>\n","    <tr>\n","      <th>11</th>\n","      <td>Botanique</td>\n","    </tr>\n","    <tr>\n","      <th>12</th>\n","      <td>Chimie</td>\n","    </tr>\n","    <tr>\n","      <th>13</th>\n","      <td>Dessin. Arts décoratifs</td>\n","    </tr>\n","    <tr>\n","      <th>14</th>\n","      <td>Droit</td>\n","    </tr>\n","    <tr>\n","      <th>15</th>\n","      <td>Ethnonymes</td>\n","    </tr>\n","    <tr>\n","      <th>16</th>\n","      <td>Géographie</td>\n","    </tr>\n","    <tr>\n","      <th>17</th>\n","      <td>Géographie de l'Europe</td>\n","    </tr>\n","    <tr>\n","      <th>18</th>\n","      <td>Géographie de la France</td>\n","    </tr>\n","    <tr>\n","      <th>19</th>\n","      <td>Géographie du reste du monde</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                                          theme\n","0                       Administration publique\n","1                     Anthropologie. Ethnologie\n","2                                  Architecture\n","3   Archéologie. Préhistoire. Histoire ancienne\n","4                                           Art\n","5                     Art et science militaires\n","6                             Arts du spectacle\n","7                               Arts graphiques\n","8                                    Astronomie\n","9                                   Audiovisuel\n","10                                     Biologie\n","11                                    Botanique\n","12                                       Chimie\n","13                      Dessin. Arts décoratifs\n","14                                        Droit\n","15                                   Ethnonymes\n","16                                   Géographie\n","17                       Géographie de l'Europe\n","18                      Géographie de la France\n","19                 Géographie du reste du monde"]},"execution_count":8,"metadata":{},"output_type":"execute_result"}],"source":["requete = BNF_prefix + \"\"\"\n","SELECT distinct ?theme\n","WHERE {# A compléter\n","\n","\n","  # une oeuvre est associée a (au moins) un auteur\n","  ?livre dc:creator ?auteur .\n","\n","  # un livre est un ouvrage dont la forme d'expression est textuelle (te)\n","  ?livre rda:P10004 <http://data.bnf.fr/vocabulary/work-form/te> .\n","\n","  # livre écrit en langue française\n","  ?livre dc:language <http://id.loc.gov/vocabulary/iso639-2/fre> .\n","\n","  # le livre a au moins un theme\n","  ?livre bnf:subject ?theme.\n","\n","  # l'auteur existe également dans une autre source,\n","  # on dit qu'il est \"aligné\" avec un autre instance du même individu.\n","  ?auteur owl:sameAs ?auteurDbpedia .\n","\n","  # la référence externe \"pointe\" vers dbpedia\n","  FILTER ( regex(?auteurDbpedia, \"http://fr.dbpedia.org\")  )\n","\n","}\n","ORDER BY ?theme\n","LIMIT 20\n","\"\"\"\n","\n","BNF.setQuery(requete)\n","resultats = BNF.query().bindings\n","afficherResultat(resultats)\n","\n","# Exemple:\n","# Informatique\n","# Langues\n","# Philosophie"]},{"cell_type":"markdown","metadata":{"id":"K5mu8CL-H2Qo"},"source":["###  BNF A1 : une liste d'auteurs\n","\n","A1 : Liste des auteurs de livres écrits en français et nés pendant une certaine période, par exemple au 20eme siècle. Afficher le nom de l'auteur, son année et lieu de naissance.\n","\n"]},{"cell_type":"code","execution_count":9,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":711},"executionInfo":{"elapsed":989,"status":"ok","timestamp":1711657454755,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"JG98_IoJIX0s","outputId":"36cbc5ea-3c00-4b8a-eb7e-f4a66c0d186f"},"outputs":[{"name":"stdout","output_type":"stream","text":["20 éléments\n","schéma:  ['nom', 'naissance', 'lieu']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>nom</th>\n","      <th>naissance</th>\n","      <th>lieu</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Enrichetta Leospo</td>\n","      <td>1947</td>\n","      <td>Turin, Italie</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Jean Taffanel</td>\n","      <td>1917</td>\n","      <td>Mailhac (Aude)</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Marie-Thérèse Laureilhe</td>\n","      <td>1913</td>\n","      <td>Paris</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Stefan Priacel</td>\n","      <td>1904</td>\n","      <td>Wroclaw (Pologne)</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Albert Meister</td>\n","      <td>1927</td>\n","      <td>Delsberg (Suisse)</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>André Tuilier</td>\n","      <td>1921</td>\n","      <td>Paris (France)</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>Michèle Faivre-Jussiaux</td>\n","      <td>1947</td>\n","      <td>Pays de Montbéliard (Doubs)</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Alexandre Popovic</td>\n","      <td>1931</td>\n","      <td>Belgrade (Yougoslavie, aujourd'hui Serbie)</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>Marthe Philipp</td>\n","      <td>1922</td>\n","      <td>Essen, RFA</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>Germaine Sneyers</td>\n","      <td>1907</td>\n","      <td>Schaerbeek (Belgique)</td>\n","    </tr>\n","    <tr>\n","      <th>10</th>\n","      <td>Pierre De Locht</td>\n","      <td>1916</td>\n","      <td>Bruxelles</td>\n","    </tr>\n","    <tr>\n","      <th>11</th>\n","      <td>Serge Perrault</td>\n","      <td>1920</td>\n","      <td>Paris</td>\n","    </tr>\n","    <tr>\n","      <th>12</th>\n","      <td>Yves Beauchesne</td>\n","      <td>1948</td>\n","      <td>Sainte-Marie (Québec, Canada)</td>\n","    </tr>\n","    <tr>\n","      <th>13</th>\n","      <td>Basile Aggoula</td>\n","      <td>1932</td>\n","      <td>Bartelli (Irak)</td>\n","    </tr>\n","    <tr>\n","      <th>14</th>\n","      <td>Guy Perrier</td>\n","      <td>1925</td>\n","      <td>Chepniers (Charente-Maritime)</td>\n","    </tr>\n","    <tr>\n","      <th>15</th>\n","      <td>Jean Condou</td>\n","      <td>1918</td>\n","      <td>Marmande (Lot-et-Garonne)</td>\n","    </tr>\n","    <tr>\n","      <th>16</th>\n","      <td>Claire Guézengar</td>\n","      <td>1972</td>\n","      <td>Lesneven (Finistère)</td>\n","    </tr>\n","    <tr>\n","      <th>17</th>\n","      <td>Pierre Bout</td>\n","      <td>1906</td>\n","      <td>Paris</td>\n","    </tr>\n","    <tr>\n","      <th>18</th>\n","      <td>Jacques Weygand</td>\n","      <td>1905</td>\n","      <td>Saumur (Maine-et-Loire)</td>\n","    </tr>\n","    <tr>\n","      <th>19</th>\n","      <td>Henri Fabre-Colbert</td>\n","      <td>1914</td>\n","      <td>Cornilhac-Corbières (Aude)</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                        nom naissance  \\\n","0         Enrichetta Leospo      1947   \n","1             Jean Taffanel      1917   \n","2   Marie-Thérèse Laureilhe      1913   \n","3            Stefan Priacel      1904   \n","4            Albert Meister      1927   \n","5             André Tuilier      1921   \n","6   Michèle Faivre-Jussiaux      1947   \n","7         Alexandre Popovic      1931   \n","8            Marthe Philipp      1922   \n","9          Germaine Sneyers      1907   \n","10          Pierre De Locht      1916   \n","11           Serge Perrault      1920   \n","12          Yves Beauchesne      1948   \n","13           Basile Aggoula      1932   \n","14              Guy Perrier      1925   \n","15              Jean Condou      1918   \n","16         Claire Guézengar      1972   \n","17              Pierre Bout      1906   \n","18          Jacques Weygand      1905   \n","19      Henri Fabre-Colbert      1914   \n","\n","                                          lieu  \n","0                                Turin, Italie  \n","1                               Mailhac (Aude)  \n","2                                        Paris  \n","3                            Wroclaw (Pologne)  \n","4                            Delsberg (Suisse)  \n","5                               Paris (France)  \n","6                  Pays de Montbéliard (Doubs)  \n","7   Belgrade (Yougoslavie, aujourd'hui Serbie)  \n","8                                   Essen, RFA  \n","9                        Schaerbeek (Belgique)  \n","10                                   Bruxelles  \n","11                                       Paris  \n","12               Sainte-Marie (Québec, Canada)  \n","13                             Bartelli (Irak)  \n","14               Chepniers (Charente-Maritime)  \n","15                   Marmande (Lot-et-Garonne)  \n","16                        Lesneven (Finistère)  \n","17                                       Paris  \n","18                     Saumur (Maine-et-Loire)  \n","19                  Cornilhac-Corbières (Aude)  "]},"execution_count":9,"metadata":{},"output_type":"execute_result"}],"source":["requete = BNF_prefix + \"\"\"\n","SELECT distinct ?nom  ?naissance ?lieu\n","WHERE {\n","\n","# une oeuvre est associée a (au moins) un auteur\n","?livre dc:creator ?auteur.\n","\n","# livre écrit en français\n","?livre dc:language <http://id.loc.gov/vocabulary/iso639-2/fre> .\n","\n","# un auteur a un nom\n","?auteur foaf:name ?nom .\n","\n","# un auteur a une année et un lieu de naissance\n","?auteur bio:birth ?naissance.\n","?auteur voc2:placeOfBirth ?lieu\n","\n","# on sélectionne les années de naissance dans l'intervalle [1900, 2000]\n","FILTER (xsd:integer (?naissance) > '1900'^^xsd:integer\n","     && xsd:integer (?naissance) < '2000'^^xsd:integer )\n","}\n","#ORDER BY ?nom\n","LIMIT 20\n","\"\"\"\n","\n","BNF.setQuery(requete)\n","resultats = BNF.query().bindings\n","afficherResultat(resultats)"]},{"cell_type":"markdown","metadata":{"id":"5rDrC98fmkw1"},"source":["###  BNF A2 : les auteurs de la BNF référencés dans dbpedia\n","Les auteurs ayant un identifiant externe pointant vers dbpedia\n"]},{"cell_type":"code","execution_count":10,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":397},"executionInfo":{"elapsed":7214,"status":"ok","timestamp":1711657461965,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"qDfx7tAqzUqp","outputId":"1367823d-a166-4152-ba9b-778789f7ff73"},"outputs":[{"name":"stdout","output_type":"stream","text":["10 éléments\n","schéma:  ['nom', 'naissance', 'auteurDbpedia']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>nom</th>\n","      <th>naissance</th>\n","      <th>auteurDbpedia</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Vickie Gendreau</td>\n","      <td>1989</td>\n","      <td>http://fr.dbpedia.org/resource/Vickie_Gendreau</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Axl Cendres</td>\n","      <td>1982</td>\n","      <td>http://fr.dbpedia.org/resource/Axl_Cendres</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Geneviève Castrée</td>\n","      <td>1981</td>\n","      <td>http://fr.dbpedia.org/resource/Genevi%C3%A8ve_Castr%C3%A9e</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Isabelle Périer</td>\n","      <td>1978</td>\n","      <td>http://fr.dbpedia.org/resource/Isabelle_P%C3%A9rier</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Nathanaël Dupré La Tour</td>\n","      <td>1977</td>\n","      <td>http://fr.dbpedia.org/resource/Nathana%C3%ABl_Dupr%C3%A9_La_Tour</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>Coralie Delaume</td>\n","      <td>1976</td>\n","      <td>http://fr.dbpedia.org/resource/Coralie_Delaume</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>Claire Guézengar</td>\n","      <td>1972</td>\n","      <td>http://fr.dbpedia.org/resource/Claire_Guezengar</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Philippe Nassif</td>\n","      <td>1971</td>\n","      <td>http://fr.dbpedia.org/resource/Philippe_Nassif</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>Fatou Cissé</td>\n","      <td>1971</td>\n","      <td>http://fr.dbpedia.org/resource/Fatou_Fanny-Ciss%C3%A9</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>Benoït Violier</td>\n","      <td>1971</td>\n","      <td>http://fr.dbpedia.org/resource/Beno%C3%AEt_Violier</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                       nom naissance  \\\n","0          Vickie Gendreau      1989   \n","1              Axl Cendres      1982   \n","2        Geneviève Castrée      1981   \n","3          Isabelle Périer      1978   \n","4  Nathanaël Dupré La Tour      1977   \n","5          Coralie Delaume      1976   \n","6         Claire Guézengar      1972   \n","7          Philippe Nassif      1971   \n","8              Fatou Cissé      1971   \n","9           Benoït Violier      1971   \n","\n","                                                      auteurDbpedia  \n","0                    http://fr.dbpedia.org/resource/Vickie_Gendreau  \n","1                        http://fr.dbpedia.org/resource/Axl_Cendres  \n","2        http://fr.dbpedia.org/resource/Genevi%C3%A8ve_Castr%C3%A9e  \n","3               http://fr.dbpedia.org/resource/Isabelle_P%C3%A9rier  \n","4  http://fr.dbpedia.org/resource/Nathana%C3%ABl_Dupr%C3%A9_La_Tour  \n","5                    http://fr.dbpedia.org/resource/Coralie_Delaume  \n","6                   http://fr.dbpedia.org/resource/Claire_Guezengar  \n","7                    http://fr.dbpedia.org/resource/Philippe_Nassif  \n","8             http://fr.dbpedia.org/resource/Fatou_Fanny-Ciss%C3%A9  \n","9                http://fr.dbpedia.org/resource/Beno%C3%AEt_Violier  "]},"execution_count":10,"metadata":{},"output_type":"execute_result"}],"source":["requete = BNF_prefix + \"\"\"\n","SELECT distinct ?nom  ?naissance ?auteurDbpedia\n","WHERE {\n","\n","# une oeuvre est associée a (au moins) un auteur\n","?livre dc:creator ?auteur.\n","\n","# livre écrit en français\n","?livre dc:language <http://id.loc.gov/vocabulary/iso639-2/fre> .\n","\n","# un auteur a un nom, et une année de naissance\n","?auteur foaf:name ?nom ; bio:birth ?naissance .\n","\n","# l'auteur existe également dans une source externe,\n","# on dit qu'il est \"aligné\" avec un autre instance du même individu.\n","?auteur owl:sameAs ?auteurDbpedia .\n","\n","# naissance dans l'intervalle [1900, 2000] et la référence externe \"pointe\" vers dbpedia\n","FILTER (xsd:integer (?naissance) > '1900'^^xsd:integer\n","     && xsd:integer (?naissance) < '2000'^^xsd:integer\n","     && regex(?auteurDbpedia, \"http://fr.dbpedia.org\")\n","     )\n","}\n","ORDER BY desc(?naissance)\n","LIMIT 10\n","\"\"\"\n","\n","BNF.setQuery(requete)\n","\n","resultats = BNF.query().bindings\n","afficherResultat(resultats)"]},{"cell_type":"markdown","metadata":{"id":"SdArE9Sd8TpF"},"source":["### BNF A3 : Les auteurs d'une oeuvre philosophique\n","\n","Voir T1 pour la liste des thèmes possibles autres que la philosophie.\n","\n","On se limite aux oeuvres écrite en français et sont l'auteur est référencé dans dbpedia france."]},{"cell_type":"code","execution_count":11,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":241},"executionInfo":{"elapsed":1392,"status":"ok","timestamp":1711657463352,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"8yqeCT3F8cO-","outputId":"c89b229d-0ea6-4262-c77f-0cd128b44c1c"},"outputs":[{"name":"stdout","output_type":"stream","text":["20 éléments\n","schéma:  ['nom', 'auteurDbpedia']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>nom</th>\n","      <th>auteurDbpedia</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Alexis Carrel</td>\n","      <td>http://fr.dbpedia.org/resource/Alexis_Carrel</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Antoine de Rivarol</td>\n","      <td>http://fr.dbpedia.org/resource/Antoine_de_Rivarol</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Bernard-Henri Lévy</td>\n","      <td>http://fr.dbpedia.org/resource/Bernard-Henri_L%C3%A9vy</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Bernard de Fontenelle</td>\n","      <td>http://fr.dbpedia.org/resource/Bernard_Le_Bouyer_de_Fontenelle</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Claude Guillon</td>\n","      <td>http://fr.dbpedia.org/resource/Claude_Guillon_%28%C3%A9crivain%29</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                     nom  \\\n","0          Alexis Carrel   \n","1     Antoine de Rivarol   \n","2     Bernard-Henri Lévy   \n","3  Bernard de Fontenelle   \n","4         Claude Guillon   \n","\n","                                                       auteurDbpedia  \n","0                       http://fr.dbpedia.org/resource/Alexis_Carrel  \n","1                  http://fr.dbpedia.org/resource/Antoine_de_Rivarol  \n","2             http://fr.dbpedia.org/resource/Bernard-Henri_L%C3%A9vy  \n","3     http://fr.dbpedia.org/resource/Bernard_Le_Bouyer_de_Fontenelle  \n","4  http://fr.dbpedia.org/resource/Claude_Guillon_%28%C3%A9crivain%29  "]},"execution_count":11,"metadata":{},"output_type":"execute_result"}],"source":["requete = BNF_prefix + \"\"\"\n","SELECT distinct ?nom ?auteurDbpedia ?type_ouvrage\n","WHERE {\n","\n","  ?livre dc:creator ?auteur .\n","\n","  # un livre est un ouvrage textuel\n","  # (revoir la formulation de ce triplet...)\n","  # ?livre rda:P10004 <http://data.bnf.fr/vocabulary/work-form/te> .\n","\n","  # le livre existe également dans une autre source\n","  ?livre owl:sameAs ?livreWiki .\n","\n","  # livre écrit en français\n","  ?livre dc:language <http://id.loc.gov/vocabulary/iso639-2/fre> .\n","\n","  # le livre a pour theme \"Philosophie\"\n","  ?livre bnf:subject \"Philosophie\" .\n","\n","  # le nom de l'auteur\n","  ?auteur foaf:name ?nom .\n","\n","  # l'auteur existe également dans une autre source\n","  ?auteur owl:sameAs ?auteurDbpedia .\n","\n","  FILTER ( regex(?livreWiki, \"http://wikidata.org\")\n","       &&  regex(?auteurDbpedia, \"http://fr.dbpedia.org\")\n","  )\n","}\n","ORDER BY ?auteurDbpedia\n","\n","LIMIT 20\n","\"\"\"\n","\n","BNF.setQuery(requete)\n","resultats =  BNF.query().bindings\n","afficherResultat(resultats, 5)"]},{"cell_type":"markdown","metadata":{"id":"YKeWGRI4HPPu"},"source":["###  BNF L1 : Les livres avec leurs auteurs\n","\n","Les livres écrit en français au 21eme siècle,  référencés dans wikidata et dont l'auteur est référencé dans dbpedia"]},{"cell_type":"code","execution_count":12,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":798},"executionInfo":{"elapsed":6599,"status":"ok","timestamp":1711657469947,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"EOf7x6RIGvRP","outputId":"80443807-194e-454a-9814-43d6da0ec656"},"outputs":[{"name":"stdout","output_type":"stream","text":["20 éléments\n","schéma:  ['annee', 'nom', 'titre', 'auteurDbpedia']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>annee</th>\n","      <th>nom</th>\n","      <th>titre</th>\n","      <th>auteurDbpedia</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>2006</td>\n","      <td>Jonathan Littell</td>\n","      <td>Les Bienveillantes</td>\n","      <td>http://fr.dbpedia.org/resource/Jonathan_Littell</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>2001</td>\n","      <td>Claude Simon</td>\n","      <td>Le tramway</td>\n","      <td>http://fr.dbpedia.org/resource/Claude_Simon</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>2002</td>\n","      <td>André Gide</td>\n","      <td>Le ramier</td>\n","      <td>http://fr.dbpedia.org/resource/Andr%C3%A9_Gide</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>2001</td>\n","      <td>Yves Bonnefoy</td>\n","      <td>Les planches courbes</td>\n","      <td>http://fr.dbpedia.org/resource/Yves_Bonnefoy</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>2003</td>\n","      <td>J. M. G. Le Clézio</td>\n","      <td>Révolutions</td>\n","      <td>http://fr.dbpedia.org/resource/J._M._G._Le_Cl%C3%A9zio</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>2001</td>\n","      <td>Catherine Millet</td>\n","      <td>La vie sexuelle de Catherine M.</td>\n","      <td>http://fr.dbpedia.org/resource/Catherine_Millet</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>2001</td>\n","      <td>Michel Houellebecq</td>\n","      <td>Plateforme</td>\n","      <td>http://fr.dbpedia.org/resource/Michel_Houellebecq</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>2005</td>\n","      <td>Michel Onfray</td>\n","      <td>Traité d'athéologie</td>\n","      <td>http://fr.dbpedia.org/resource/Michel_Onfray</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>2006</td>\n","      <td>Pascal Quignard</td>\n","      <td>Villa Amalia</td>\n","      <td>http://fr.dbpedia.org/resource/Pascal_Quignard</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>2007</td>\n","      <td>Nathacha Appanah</td>\n","      <td>Le dernier frère</td>\n","      <td>http://fr.dbpedia.org/resource/Nathacha_Appanah</td>\n","    </tr>\n","    <tr>\n","      <th>10</th>\n","      <td>2010</td>\n","      <td>Jean Echenoz</td>\n","      <td>Des éclairs</td>\n","      <td>http://fr.dbpedia.org/resource/Jean_Echenoz</td>\n","    </tr>\n","    <tr>\n","      <th>11</th>\n","      <td>2012</td>\n","      <td>Waǧdī Muʿawwaḍ</td>\n","      <td>Anima</td>\n","      <td>http://fr.dbpedia.org/resource/Wajdi_Mouawad</td>\n","    </tr>\n","    <tr>\n","      <th>12</th>\n","      <td>2014</td>\n","      <td>Édouard Louis</td>\n","      <td>En finir avec Eddy Bellegueule</td>\n","      <td>http://fr.dbpedia.org/resource/%C3%89douard_Louis</td>\n","    </tr>\n","    <tr>\n","      <th>13</th>\n","      <td>2007</td>\n","      <td>Comité invisible. France</td>\n","      <td>L'insurrection qui vient</td>\n","      <td>http://fr.dbpedia.org/resource/Comit%C3%A9_invisible</td>\n","    </tr>\n","    <tr>\n","      <th>14</th>\n","      <td>2008</td>\n","      <td>Jean Echenoz</td>\n","      <td>Courir</td>\n","      <td>http://fr.dbpedia.org/resource/Jean_Echenoz</td>\n","    </tr>\n","    <tr>\n","      <th>15</th>\n","      <td>2018</td>\n","      <td>Peter Gelderloos</td>\n","      <td>Comment la non-violence protège l'État : essai sur l'inefficacité des mouvements sociaux</td>\n","      <td>http://fr.dbpedia.org/resource/Peter_Gelderloos</td>\n","    </tr>\n","    <tr>\n","      <th>16</th>\n","      <td>2004</td>\n","      <td>Alain Damasio</td>\n","      <td>La horde du contrevent</td>\n","      <td>http://fr.dbpedia.org/resource/Alain_Damasio</td>\n","    </tr>\n","    <tr>\n","      <th>17</th>\n","      <td>2013</td>\n","      <td>Thomas Piketty</td>\n","      <td>Le capital au XXIe siècle</td>\n","      <td>http://fr.dbpedia.org/resource/Thomas_Piketty</td>\n","    </tr>\n","    <tr>\n","      <th>18</th>\n","      <td>2010</td>\n","      <td>Michel Onfray</td>\n","      <td>Le crépuscule d'une idole</td>\n","      <td>http://fr.dbpedia.org/resource/Michel_Onfray</td>\n","    </tr>\n","    <tr>\n","      <th>19</th>\n","      <td>2015</td>\n","      <td>Michel Houellebecq</td>\n","      <td>Soumission</td>\n","      <td>http://fr.dbpedia.org/resource/Michel_Houellebecq</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   annee                       nom  \\\n","0   2006          Jonathan Littell   \n","1   2001              Claude Simon   \n","2   2002                André Gide   \n","3   2001             Yves Bonnefoy   \n","4   2003        J. M. G. Le Clézio   \n","5   2001          Catherine Millet   \n","6   2001        Michel Houellebecq   \n","7   2005             Michel Onfray   \n","8   2006           Pascal Quignard   \n","9   2007          Nathacha Appanah   \n","10  2010              Jean Echenoz   \n","11  2012           Waǧdī Muʿawwaḍ   \n","12  2014             Édouard Louis   \n","13  2007  Comité invisible. France   \n","14  2008              Jean Echenoz   \n","15  2018          Peter Gelderloos   \n","16  2004             Alain Damasio   \n","17  2013            Thomas Piketty   \n","18  2010             Michel Onfray   \n","19  2015        Michel Houellebecq   \n","\n","                                                                                       titre  \\\n","0                                                                         Les Bienveillantes   \n","1                                                                                 Le tramway   \n","2                                                                                  Le ramier   \n","3                                                                       Les planches courbes   \n","4                                                                                Révolutions   \n","5                                                            La vie sexuelle de Catherine M.   \n","6                                                                                 Plateforme   \n","7                                                                        Traité d'athéologie   \n","8                                                                               Villa Amalia   \n","9                                                                           Le dernier frère   \n","10                                                                               Des éclairs   \n","11                                                                                     Anima   \n","12                                                            En finir avec Eddy Bellegueule   \n","13                                                                  L'insurrection qui vient   \n","14                                                                                    Courir   \n","15  Comment la non-violence protège l'État : essai sur l'inefficacité des mouvements sociaux   \n","16                                                                    La horde du contrevent   \n","17                                                                 Le capital au XXIe siècle   \n","18                                                                 Le crépuscule d'une idole   \n","19                                                                                Soumission   \n","\n","                                             auteurDbpedia  \n","0          http://fr.dbpedia.org/resource/Jonathan_Littell  \n","1              http://fr.dbpedia.org/resource/Claude_Simon  \n","2           http://fr.dbpedia.org/resource/Andr%C3%A9_Gide  \n","3             http://fr.dbpedia.org/resource/Yves_Bonnefoy  \n","4   http://fr.dbpedia.org/resource/J._M._G._Le_Cl%C3%A9zio  \n","5          http://fr.dbpedia.org/resource/Catherine_Millet  \n","6        http://fr.dbpedia.org/resource/Michel_Houellebecq  \n","7             http://fr.dbpedia.org/resource/Michel_Onfray  \n","8           http://fr.dbpedia.org/resource/Pascal_Quignard  \n","9          http://fr.dbpedia.org/resource/Nathacha_Appanah  \n","10             http://fr.dbpedia.org/resource/Jean_Echenoz  \n","11            http://fr.dbpedia.org/resource/Wajdi_Mouawad  \n","12       http://fr.dbpedia.org/resource/%C3%89douard_Louis  \n","13    http://fr.dbpedia.org/resource/Comit%C3%A9_invisible  \n","14             http://fr.dbpedia.org/resource/Jean_Echenoz  \n","15         http://fr.dbpedia.org/resource/Peter_Gelderloos  \n","16            http://fr.dbpedia.org/resource/Alain_Damasio  \n","17           http://fr.dbpedia.org/resource/Thomas_Piketty  \n","18            http://fr.dbpedia.org/resource/Michel_Onfray  \n","19       http://fr.dbpedia.org/resource/Michel_Houellebecq  "]},"execution_count":12,"metadata":{},"output_type":"execute_result"}],"source":["requete = BNF_prefix + \"\"\"\n","SELECT distinct ?annee ?nom ?titre ?auteurDbpedia\n","WHERE {\n","\n","  ?livre dc:creator ?auteur .\n","\n","  # l'année de parution du livre\n","  ?livre dc:date ?annee .\n","\n","  # le titre du livre\n","  ?livre dc:title ?titre .\n","\n","  # un livre est un ouvrage textuel\n","  ?livre rda:P10004 <http://data.bnf.fr/vocabulary/work-form/te> .\n","\n","  # le livre existe également dans une autre source\n","  ?livre owl:sameAs ?livreWiki .\n","\n","  # livre écrit en français\n","  ?livre dc:language <http://id.loc.gov/vocabulary/iso639-2/fre> .\n","\n","  # le nom de l'auteur\n","  ?auteur foaf:name ?nom.\n","\n","  # l'auteur existe également dans une autre source\n","  ?auteur owl:sameAs ?auteurDbpedia .\n","\n","  FILTER (\n","       xsd:integer (?annee) > '2000'^^xsd:integer\n","    && xsd:integer (?annee) < '2099'^^xsd:integer\n","    && regex(?livreWiki, \"http://wikidata.org\")\n","    &&  regex(?auteurDbpedia, \"http://fr.dbpedia.org\")\n","  )\n","}\n","#ORDER BY desc(?annee)\n","\n","LIMIT 20\n","\"\"\"\n","\n","BNF.setQuery(requete)\n","resultats =  BNF.query().bindings\n","afficherResultat(resultats)"]},{"cell_type":"markdown","metadata":{"id":"f8MHZR2v9nWL"},"source":["## Source 2 : DBPedia France"]},{"cell_type":"markdown","metadata":{"id":"lUV0Hse4IqBD"},"source":["### D1 : Informations sur une personne dont le nom contient certains mots.\n","Afficher le nom, nationalité, profession, date et lieu de naissance"]},{"cell_type":"code","execution_count":13,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":695},"executionInfo":{"elapsed":2104,"status":"ok","timestamp":1711657472038,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"kE7pEqETIl00","outputId":"e659af30-e313-4410-c49f-95eb76a040a8"},"outputs":[{"name":"stdout","output_type":"stream","text":["10 éléments\n","schéma:  ['p', 'name', 'nationalité', 'profession', 'naissance', 'lieu']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>p</th>\n","      <th>name</th>\n","      <th>nationalité</th>\n","      <th>profession</th>\n","      <th>naissance</th>\n","      <th>lieu</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td>Victor Hugo de Azevedo Coutinho</td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td>Victor Hugo de Azevedo Coutinho</td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td>Victor Hugo de Azevedo Coutinho</td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td>Victor Hugo de Azevedo Coutinho</td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_Green</td>\n","      <td>Victor Hugo Green</td>\n","      <td>Américain</td>\n","      <td></td>\n","      <td>1892</td>\n","      <td>http://fr.dbpedia.org/resource/New_York</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_Green</td>\n","      <td>Victor Hugo Green</td>\n","      <td>Américain</td>\n","      <td></td>\n","      <td>1892</td>\n","      <td>http://fr.dbpedia.org/resource/États-Unis</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                                                                p  \\\n","0  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","1  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","2  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","3  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","4  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","5  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","6  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","7  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","8                http://fr.dbpedia.org/resource/Victor_Hugo_Green   \n","9                http://fr.dbpedia.org/resource/Victor_Hugo_Green   \n","\n","                              name                              nationalité  \\\n","0  Victor Hugo de Azevedo Coutinho  http://fr.dbpedia.org/resource/Portugal   \n","1                                   http://fr.dbpedia.org/resource/Portugal   \n","2                                   http://fr.dbpedia.org/resource/Portugal   \n","3                                   http://fr.dbpedia.org/resource/Portugal   \n","4  Victor Hugo de Azevedo Coutinho  http://fr.dbpedia.org/resource/Portugal   \n","5  Victor Hugo de Azevedo Coutinho  http://fr.dbpedia.org/resource/Portugal   \n","6                                   http://fr.dbpedia.org/resource/Portugal   \n","7  Victor Hugo de Azevedo Coutinho  http://fr.dbpedia.org/resource/Portugal   \n","8                Victor Hugo Green                                Américain   \n","9                Victor Hugo Green                                Américain   \n","\n","                                profession naissance  \\\n","0  http://fr.dbpedia.org/resource/Officier      1871   \n","1  http://fr.dbpedia.org/resource/Officier      1871   \n","2  http://fr.dbpedia.org/resource/Officier      1871   \n","3  http://fr.dbpedia.org/resource/Officier      1871   \n","4  http://fr.dbpedia.org/resource/Officier      1871   \n","5  http://fr.dbpedia.org/resource/Officier      1871   \n","6  http://fr.dbpedia.org/resource/Officier      1871   \n","7  http://fr.dbpedia.org/resource/Officier      1871   \n","8                                               1892   \n","9                                               1892   \n","\n","                                        lieu  \n","0       http://fr.dbpedia.org/resource/Macao  \n","1       http://fr.dbpedia.org/resource/Macao  \n","2       http://fr.dbpedia.org/resource/Macao  \n","3       http://fr.dbpedia.org/resource/Macao  \n","4       http://fr.dbpedia.org/resource/Macao  \n","5       http://fr.dbpedia.org/resource/Macao  \n","6       http://fr.dbpedia.org/resource/Macao  \n","7       http://fr.dbpedia.org/resource/Macao  \n","8    http://fr.dbpedia.org/resource/New_York  \n","9  http://fr.dbpedia.org/resource/États-Unis  "]},"execution_count":13,"metadata":{},"output_type":"execute_result"}],"source":["requete_parametree = DBPEDIA_prefix + \"\"\"\n","  SELECT ?p ?name ?nationalité ?profession year(xsd:dateTime(?naissance)) as ?naissance  ?lieu\n","  WHERE {\n","    ?p a dbo:Person .\n","    ?p foaf:name ?name .\n","    ?p dbo:birthDate ?naissance\n","    optional {?p dbp:nationalité ?nationalité}\n","    optional {?p dbp:profession ?profession}\n","    optional {?p dbp:lieuDeNaissance ?lieu}\n","\n","  FILTER (regex(?p, \"{MOTIF}\", \"i\") )\n","  }\n","  LIMIT 10\n","\"\"\"\n","\n","# l'expression régulière du nom à retrouver\n","motif = \"Victor.*Hug\"\n","\n","requete = requete_parametree.replace(\"{MOTIF}\", motif)\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","afficherResultat(res)"]},{"cell_type":"markdown","metadata":{"id":"RmrC3XpMuVis"},"source":["### D2 : les infos détaillées sur une certaine personne"]},{"cell_type":"code","execution_count":14,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":178},"executionInfo":{"elapsed":449,"status":"ok","timestamp":1711657472483,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"aQyPyuSmuavU","outputId":"63134046-1126-4d13-d188-3f57b47ba6e9"},"outputs":[{"name":"stdout","output_type":"stream","text":["3 éléments\n","schéma:  ['name', 'interet', 'idee']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>name</th>\n","      <th>interet</th>\n","      <th>idee</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Philosophie</td>\n","      <td>Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Politique</td>\n","      <td>Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Éthique</td>\n","      <td>Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                 name                                     interet  \\\n","0  Simone de Beauvoir  http://fr.dbpedia.org/resource/Philosophie   \n","1  Simone de Beauvoir    http://fr.dbpedia.org/resource/Politique   \n","2  Simone de Beauvoir      http://fr.dbpedia.org/resource/Éthique   \n","\n","                                                                        idee  \n","0  Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité  \n","1  Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité  \n","2  Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité  "]},"execution_count":14,"metadata":{},"output_type":"execute_result"}],"source":["requete_parametree = DBPEDIA_prefix + \"\"\"\n","  SELECT distinct  ?name ?nationalite ?interet ?idee\n","  WHERE {\n","    ?pers foaf:name ?name\n","    optional {?pers dbp:nationalité ?nationalite}\n","    optional {?pers dbo:mainInterest ?interet}\n","    optional {?pers dbp:idéesRemarquables ?idee}\n","\n","    FILTER ( ?pers = <{PERSONNE}> && STRLEN(?name) != 0)\n","  }\n","  order by ?interet ?idee\n","  LIMIT 20\n","\"\"\"\n","# On fixe une certaine personne\n","personne = 'http://fr.dbpedia.org/resource/Simone_de_Beauvoir'\n","#personne = 'http://fr.dbpedia.org/resource/Jean-Paul_Sartre'\n","\n","# fixer le nom de la personne dans la requête\n","requete = requete_parametree.replace(\"{PERSONNE}\", personne)\n","\n","# print(\"la requête est :\", requete)\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","afficherResultat(res)"]},{"cell_type":"markdown","metadata":{"id":"FV5k4Bnd1QMV"},"source":["### D3 : la liste des oeuvres principales d'une personne donnée"]},{"cell_type":"code","execution_count":15,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":241},"executionInfo":{"elapsed":308,"status":"ok","timestamp":1711657472789,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"vGoCcvdp1bsz","outputId":"a7c9c396-3ceb-450c-825e-dd835b805f53"},"outputs":[{"name":"stdout","output_type":"stream","text":["5 éléments\n","schéma:  ['name', 'oeuvre']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>name</th>\n","      <th>oeuvre</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>L'Invitée</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>La Force de l'âge</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>Le Deuxième Sexe</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>Les Mandarins</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>Mémoires d'une jeune fille rangée</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                 name                             oeuvre\n","0  Simone de Beauvoir                          L'Invitée\n","1  Simone de Beauvoir                  La Force de l'âge\n","2  Simone de Beauvoir                   Le Deuxième Sexe\n","3  Simone de Beauvoir                      Les Mandarins\n","4  Simone de Beauvoir  Mémoires d'une jeune fille rangée"]},"execution_count":15,"metadata":{},"output_type":"execute_result"}],"source":["requete_parametree = DBPEDIA_prefix +  \"\"\"\n","    SELECT distinct ?name ?oeuvre\n","    WHERE {\n","      ?pers foaf:name ?name\n","      optional {?pers  dbp:œuvresPrincipales ?oeuvre}\n","    FILTER ( ?pers = <{PERSONNE}> && STRLEN(?name) != 0)\n","}\n","order by ?oeuvre\n","LIMIT 10\n","\"\"\"\n","# On fixe une certaine personne\n","personne = 'http://fr.dbpedia.org/resource/Simone_de_Beauvoir'\n","\n","requete = requete_parametree.replace(\"{PERSONNE}\", personne)\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","afficherResultat(res)"]},{"cell_type":"markdown","metadata":{"id":"ZFLgbjEf4MX6"},"source":["### D4 : les influenceurs d'une personne donnée"]},{"cell_type":"code","execution_count":16,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":415},"executionInfo":{"elapsed":714,"status":"ok","timestamp":1711657572964,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"MjtM2m484RvJ","outputId":"45fda9b4-8c18-4991-c2ca-d6b150ca108e"},"outputs":[{"name":"stdout","output_type":"stream","text":["10 resultats\n","10 éléments\n","schéma:  ['name', 'influenceur']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>name</th>\n","      <th>influenceur</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Alfred_Adler</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Edmund_Husserl</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Emmanuel_Kant</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/François_Poullain_de_La_Barre</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Friedrich_Engels</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Friedrich_Nietzsche</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Georg_Wilhelm_Friedrich_Hegel</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Jean-Paul_Sartre</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Karl_Marx</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Martin_Heidegger</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                 name  \\\n","0  Simone de Beauvoir   \n","1  Simone de Beauvoir   \n","2  Simone de Beauvoir   \n","3  Simone de Beauvoir   \n","4  Simone de Beauvoir   \n","5  Simone de Beauvoir   \n","6  Simone de Beauvoir   \n","7  Simone de Beauvoir   \n","8  Simone de Beauvoir   \n","9  Simone de Beauvoir   \n","\n","                                                    influenceur  \n","0                   http://fr.dbpedia.org/resource/Alfred_Adler  \n","1                 http://fr.dbpedia.org/resource/Edmund_Husserl  \n","2                  http://fr.dbpedia.org/resource/Emmanuel_Kant  \n","3  http://fr.dbpedia.org/resource/François_Poullain_de_La_Barre  \n","4               http://fr.dbpedia.org/resource/Friedrich_Engels  \n","5            http://fr.dbpedia.org/resource/Friedrich_Nietzsche  \n","6  http://fr.dbpedia.org/resource/Georg_Wilhelm_Friedrich_Hegel  \n","7               http://fr.dbpedia.org/resource/Jean-Paul_Sartre  \n","8                      http://fr.dbpedia.org/resource/Karl_Marx  \n","9               http://fr.dbpedia.org/resource/Martin_Heidegger  "]},"execution_count":16,"metadata":{},"output_type":"execute_result"}],"source":["requete_parametree = DBPEDIA_prefix + \"\"\"\n","   SELECT distinct ?name ?influenceur\n","    WHERE {\n","      ?pers foaf:name ?name\n","      optional {?pers  dbo:influencedBy ?influenceur}\n","\n","    FILTER ( ?pers = <{PERSONNE}> && STRLEN(?name) != 0)\n","}\n","order by ?influenceur\n","LIMIT 10\n","\"\"\"\n","\n","# On fixe une certaine personne\n","PERSONNE = 'http://fr.dbpedia.org/resource/Simone_de_Beauvoir'\n","#PERSONNE = 'http://fr.dbpedia.org/resource/Judith_Butler'\n","\n","# fixer le nom de la personne dans la requête\n","requete = requete_parametree.replace(\"{PERSONNE}\", PERSONNE)\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","print(len(res), 'resultats')\n","afficherResultat(res)"]},{"cell_type":"markdown","metadata":{"id":"LqQ8D31uS1Zv"},"source":["### D5 : Les auteurs nés en 2001\n","Utiliser la fonction year pour extraire l'année de naissance à partir d'une date de naissance."]},{"cell_type":"code","execution_count":17,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":397},"executionInfo":{"elapsed":663,"status":"ok","timestamp":1711657668887,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"woS_g1UbTFQy","outputId":"9b63d479-705b-494f-ee31-9e8acbcd75eb"},"outputs":[{"name":"stdout","output_type":"stream","text":["10 éléments\n","schéma:  ['p', 'name', 'naissance']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>p</th>\n","      <th>name</th>\n","      <th>naissance</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>http://fr.dbpedia.org/resource/Abraham_Attah</td>\n","      <td>Abraham Attah</td>\n","      <td>2001</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>http://fr.dbpedia.org/resource/Adam_Siao_Him_Fa</td>\n","      <td>Adam Siao Him Fa</td>\n","      <td>2001</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>http://fr.dbpedia.org/resource/Adrien_Warion</td>\n","      <td>Adrien Warion</td>\n","      <td>2001</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>http://fr.dbpedia.org/resource/Adèle_Castillon</td>\n","      <td>Adèle Castillon</td>\n","      <td>2001</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>http://fr.dbpedia.org/resource/Ai_Ogura</td>\n","      <td>Ai Ogura</td>\n","      <td>2001</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>http://fr.dbpedia.org/resource/Aiko_de_Toshi</td>\n","      <td>Aiko</td>\n","      <td>2001</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>http://fr.dbpedia.org/resource/Aleksandr_Nikichine</td>\n","      <td>Aleksandr Nikichine</td>\n","      <td>2001</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>http://fr.dbpedia.org/resource/Aleksandr_Smolyar</td>\n","      <td>Aleksandr Smolyar</td>\n","      <td>2001</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>http://fr.dbpedia.org/resource/Aleksej_Pokuševski</td>\n","      <td>Aleksej Pokuševski</td>\n","      <td>2001</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>http://fr.dbpedia.org/resource/Alessandro_Michieletto</td>\n","      <td>Alessandro Michieletto</td>\n","      <td>2001</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                                                       p  \\\n","0           http://fr.dbpedia.org/resource/Abraham_Attah   \n","1        http://fr.dbpedia.org/resource/Adam_Siao_Him_Fa   \n","2           http://fr.dbpedia.org/resource/Adrien_Warion   \n","3         http://fr.dbpedia.org/resource/Adèle_Castillon   \n","4                http://fr.dbpedia.org/resource/Ai_Ogura   \n","5           http://fr.dbpedia.org/resource/Aiko_de_Toshi   \n","6     http://fr.dbpedia.org/resource/Aleksandr_Nikichine   \n","7       http://fr.dbpedia.org/resource/Aleksandr_Smolyar   \n","8      http://fr.dbpedia.org/resource/Aleksej_Pokuševski   \n","9  http://fr.dbpedia.org/resource/Alessandro_Michieletto   \n","\n","                     name naissance  \n","0           Abraham Attah      2001  \n","1        Adam Siao Him Fa      2001  \n","2           Adrien Warion      2001  \n","3         Adèle Castillon      2001  \n","4                Ai Ogura      2001  \n","5                    Aiko      2001  \n","6     Aleksandr Nikichine      2001  \n","7       Aleksandr Smolyar      2001  \n","8      Aleksej Pokuševski      2001  \n","9  Alessandro Michieletto      2001  "]},"execution_count":17,"metadata":{},"output_type":"execute_result"}],"source":["requete_parametree = DBPEDIA_prefix + \"\"\"\n","    SELECT distinct ?p ?name year(xsd:dateTime(?naissance)) as ?naissance\n","    WHERE {\n","      ?p a dbo:Person .\n","      ?p foaf:name ?name .\n","      ?p dbo:birthDate ?naissance\n","      FILTER( regex(?naissance, \"{ANNEE}\") && STRLEN(?name) != 0)\n","    }\n","    order by ?p\n","    LIMIT 10\n","\"\"\"\n","\n","année = 2001\n","requete = requete_parametree.replace(\"{ANNEE}\", str(année))\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","afficherResultat(res)"]},{"cell_type":"markdown","metadata":{"id":"C0jnq8MeA25v"},"source":["### D6 : La liste de tous les intérets principaux\n"]},{"cell_type":"code","execution_count":18,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":397},"executionInfo":{"elapsed":855,"status":"ok","timestamp":1711657699266,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"uy5m_PAuBCgF","outputId":"b17b8508-29ff-4665-9bb2-8887aa856c50"},"outputs":[{"name":"stdout","output_type":"stream","text":["10 éléments\n","schéma:  ['interet']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>interet</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Activisme politique</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Afrique</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Agnosticisme</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Alchimie</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Amour</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>Amour platonique</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>Angélologie</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Anthropologie</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>Anthropologie linguistique</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>Anthropologie philosophique</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                       interet\n","0          Activisme politique\n","1                      Afrique\n","2                 Agnosticisme\n","3                     Alchimie\n","4                        Amour\n","5             Amour platonique\n","6                  Angélologie\n","7                Anthropologie\n","8   Anthropologie linguistique\n","9  Anthropologie philosophique"]},"execution_count":18,"metadata":{},"output_type":"execute_result"}],"source":["requete = DBPEDIA_prefix + \"\"\"\n","    SELECT distinct ?interet\n","    WHERE {\n","      ?personne dbo:mainInterest ?o .\n","      ?o rdfs:label ?interet .\n","\n","      FILTER (langMatches( lang(?interet), \"FR\" ) )\n","}\n","order by ?interet\n","LIMIT 10\n","\"\"\"\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","afficherResultat(res)"]},{"cell_type":"markdown","metadata":{"id":"6gvLL5s4F4rD"},"source":["### D7 la liste des philosophes dans Dbpedia"]},{"cell_type":"code","execution_count":19,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":415},"executionInfo":{"elapsed":597,"status":"ok","timestamp":1711657704616,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"vwv5vauxGAf6","outputId":"eb7f057c-3e95-402e-8836-c60e3b70078a"},"outputs":[{"name":"stdout","output_type":"stream","text":["durée 191 ms\n","10 éléments\n","schéma:  ['name', 'p']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>name</th>\n","      <th>p</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Œuvre_de_Friedrich_Nietzsche</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Abu_'Ali_Al-Jubbâ'i</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Abu_al-Hudhayl</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Abū_Hāshīm_al-Jubbā'ī</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Adam_Smith</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Aimé_Forest</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Al-Fârâbî</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Al-Ghazali</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Alain_(philosophe)</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Alfred_Tarski</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["  name                                                            p\n","0       http://fr.dbpedia.org/resource/Œuvre_de_Friedrich_Nietzsche\n","1                http://fr.dbpedia.org/resource/Abu_'Ali_Al-Jubbâ'i\n","2                     http://fr.dbpedia.org/resource/Abu_al-Hudhayl\n","3              http://fr.dbpedia.org/resource/Abū_Hāshīm_al-Jubbā'ī\n","4                         http://fr.dbpedia.org/resource/Adam_Smith\n","5                        http://fr.dbpedia.org/resource/Aimé_Forest\n","6                          http://fr.dbpedia.org/resource/Al-Fârâbî\n","7                         http://fr.dbpedia.org/resource/Al-Ghazali\n","8                 http://fr.dbpedia.org/resource/Alain_(philosophe)\n","9                      http://fr.dbpedia.org/resource/Alfred_Tarski"]},"execution_count":19,"metadata":{},"output_type":"execute_result"}],"source":["import time\n","\n","requete = DBPEDIA_prefix + \"\"\"\n","\n","SELECT distinct  ?name ?p\n","WHERE {\n","  ?p rdf:type dbo:Philosopher .\n","  ?p foaf:name ?name\n","}\n","order by ?name\n","limit 10\n","\"\"\"\n","\n","start_time = time.time()\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","\n","duree = int ( (time.time() - start_time) * 1000)\n","print(f\"durée {duree} ms\")\n","\n","afficherResultat(res)\n"]},{"cell_type":"markdown","metadata":{"id":"2RKTA5N6I3zj"},"source":["# Exercice 1 : Requêtes réparties entre les 2 sources BNF et DBPedia"]},{"cell_type":"markdown","metadata":{"id":"Ls1_lNNv90fo"},"source":["### J1: Jointure A3 avec D2 par boucles imbriquées\n","Proposer une solution pour calculer la jointure entre A3 sur le site BNF et D2 sur le site DBPedia.\n","Pour chaque livre de afficher son titre et son année, le nom de l'auteur, sa nationalité et la liste de ses idées remarquables."]},{"cell_type":"code","execution_count":20,"metadata":{"id":"pv-dFhIxI50c"},"outputs":[],"source":["requete = (\n","    BNF_prefix\n","    + \"\"\"\n","SELECT distinct ?livre ?nom ?naissance ?auteurDbpedia\n","WHERE {\n","\n","# une oeuvre est associée a (au moins) un auteur\n","?livre dc:creator ?auteur.\n","\n","# livre écrit en français\n","?livre dc:language <http://id.loc.gov/vocabulary/iso639-2/fre> .\n","\n","# un auteur a un nom, et une année de naissance\n","?auteur foaf:name ?nom ; bio:birth ?naissance .\n","\n","# l'auteur existe également dans une source externe,\n","# on dit qu'il est \"aligné\" avec un autre instance du même individu.\n","?auteur owl:sameAs ?auteurDbpedia .\n","\n","# naissance dans l'intervalle [1900, 2000] et la référence externe \"pointe\" vers dbpedia\n","FILTER (xsd:integer (?naissance) > '1900'^^xsd:integer \n","     && xsd:integer (?naissance) < '2000'^^xsd:integer \n","     && regex(?auteurDbpedia, \"http://fr.dbpedia.org\") \n","     )\n","}\n","ORDER BY desc(?naissance)\n","LIMIT 1000\n","\"\"\"\n",")\n","\n","BNF.setQuery(requete)\n","\n","res_A3 = BNF.query().bindings\n","df_A3 = pd.DataFrame(res_A3).map(lambda x: x.value)"]},{"cell_type":"code","execution_count":21,"metadata":{},"outputs":[{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>livre</th>\n","      <th>nom</th>\n","      <th>naissance</th>\n","      <th>auteurDbpedia</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>http://data.bnf.fr/temp-work/74939adb91e2e79ddf037e7bb72be966/#about</td>\n","      <td>Vickie Gendreau</td>\n","      <td>1989</td>\n","      <td>http://fr.dbpedia.org/resource/Vickie_Gendreau</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>http://data.bnf.fr/temp-work/3ccbde1f01fcb26e705a42921d161156/#about</td>\n","      <td>Axl Cendres</td>\n","      <td>1982</td>\n","      <td>http://fr.dbpedia.org/resource/Axl_Cendres</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>http://data.bnf.fr/temp-work/679ee62bf2e6d1965c424dc8f48f3b98/#about</td>\n","      <td>Axl Cendres</td>\n","      <td>1982</td>\n","      <td>http://fr.dbpedia.org/resource/Axl_Cendres</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>http://data.bnf.fr/temp-work/2be1462996455b4d11ec261812ed4497/#about</td>\n","      <td>Axl Cendres</td>\n","      <td>1982</td>\n","      <td>http://fr.dbpedia.org/resource/Axl_Cendres</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>http://data.bnf.fr/temp-work/dda86386c8a378808e05b81b53424a1a/#about</td>\n","      <td>Axl Cendres</td>\n","      <td>1982</td>\n","      <td>http://fr.dbpedia.org/resource/Axl_Cendres</td>\n","    </tr>\n","    <tr>\n","      <th>...</th>\n","      <td>...</td>\n","      <td>...</td>\n","      <td>...</td>\n","      <td>...</td>\n","    </tr>\n","    <tr>\n","      <th>995</th>\n","      <td>http://data.bnf.fr/temp-work/4e29441740b8eea16f7b2c65ee68685a/#about</td>\n","      <td>Gérard Salem</td>\n","      <td>1946</td>\n","      <td>http://fr.dbpedia.org/resource/G%C3%A9rard_Salem</td>\n","    </tr>\n","    <tr>\n","      <th>996</th>\n","      <td>http://data.bnf.fr/temp-work/1dff8b9d989330680fc4717b3f69b32d/#about</td>\n","      <td>Gérard Salem</td>\n","      <td>1946</td>\n","      <td>http://fr.dbpedia.org/resource/G%C3%A9rard_Salem</td>\n","    </tr>\n","    <tr>\n","      <th>997</th>\n","      <td>http://data.bnf.fr/temp-work/686f8d505a57396c2dc6aa73c18bd58b/#about</td>\n","      <td>Gérard Salem</td>\n","      <td>1946</td>\n","      <td>http://fr.dbpedia.org/resource/G%C3%A9rard_Salem</td>\n","    </tr>\n","    <tr>\n","      <th>998</th>\n","      <td>http://data.bnf.fr/temp-work/7877bad96453a4fcfec6147dd7300eda/#about</td>\n","      <td>Gérard Salem</td>\n","      <td>1946</td>\n","      <td>http://fr.dbpedia.org/resource/G%C3%A9rard_Salem</td>\n","    </tr>\n","    <tr>\n","      <th>999</th>\n","      <td>http://data.bnf.fr/temp-work/d80ef1ab47442d61c5f54ee65a014b0c/#about</td>\n","      <td>Gérard Salem</td>\n","      <td>1946</td>\n","      <td>http://fr.dbpedia.org/resource/G%C3%A9rard_Salem</td>\n","    </tr>\n","  </tbody>\n","</table>\n","<p>1000 rows × 4 columns</p>\n","</div>"],"text/plain":["                                                                    livre  \\\n","0    http://data.bnf.fr/temp-work/74939adb91e2e79ddf037e7bb72be966/#about   \n","1    http://data.bnf.fr/temp-work/3ccbde1f01fcb26e705a42921d161156/#about   \n","2    http://data.bnf.fr/temp-work/679ee62bf2e6d1965c424dc8f48f3b98/#about   \n","3    http://data.bnf.fr/temp-work/2be1462996455b4d11ec261812ed4497/#about   \n","4    http://data.bnf.fr/temp-work/dda86386c8a378808e05b81b53424a1a/#about   \n","..                                                                    ...   \n","995  http://data.bnf.fr/temp-work/4e29441740b8eea16f7b2c65ee68685a/#about   \n","996  http://data.bnf.fr/temp-work/1dff8b9d989330680fc4717b3f69b32d/#about   \n","997  http://data.bnf.fr/temp-work/686f8d505a57396c2dc6aa73c18bd58b/#about   \n","998  http://data.bnf.fr/temp-work/7877bad96453a4fcfec6147dd7300eda/#about   \n","999  http://data.bnf.fr/temp-work/d80ef1ab47442d61c5f54ee65a014b0c/#about   \n","\n","                 nom naissance  \\\n","0    Vickie Gendreau      1989   \n","1        Axl Cendres      1982   \n","2        Axl Cendres      1982   \n","3        Axl Cendres      1982   \n","4        Axl Cendres      1982   \n","..               ...       ...   \n","995     Gérard Salem      1946   \n","996     Gérard Salem      1946   \n","997     Gérard Salem      1946   \n","998     Gérard Salem      1946   \n","999     Gérard Salem      1946   \n","\n","                                        auteurDbpedia  \n","0      http://fr.dbpedia.org/resource/Vickie_Gendreau  \n","1          http://fr.dbpedia.org/resource/Axl_Cendres  \n","2          http://fr.dbpedia.org/resource/Axl_Cendres  \n","3          http://fr.dbpedia.org/resource/Axl_Cendres  \n","4          http://fr.dbpedia.org/resource/Axl_Cendres  \n","..                                                ...  \n","995  http://fr.dbpedia.org/resource/G%C3%A9rard_Salem  \n","996  http://fr.dbpedia.org/resource/G%C3%A9rard_Salem  \n","997  http://fr.dbpedia.org/resource/G%C3%A9rard_Salem  \n","998  http://fr.dbpedia.org/resource/G%C3%A9rard_Salem  \n","999  http://fr.dbpedia.org/resource/G%C3%A9rard_Salem  \n","\n","[1000 rows x 4 columns]"]},"execution_count":21,"metadata":{},"output_type":"execute_result"}],"source":["df_A3"]},{"cell_type":"code","execution_count":22,"metadata":{},"outputs":[{"data":{"text/plain":["168"]},"execution_count":22,"metadata":{},"output_type":"execute_result"}],"source":["personnes = df_A3[\"auteurDbpedia\"].unique()\n","len(personnes)"]},{"cell_type":"code","execution_count":23,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["49 éléments\n","schéma:  ['name', 'nationalite']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>name</th>\n","      <th>nationalite</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Philippe Nassif</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Franck Krebs</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>Thierry Aprile</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Emmanuel Jouanne</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>Bruno Fecteau</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>10</th>\n","      <td>Sebastian Santa Maria</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>11</th>\n","      <td>Mario Ramos</td>\n","      <td>Belge</td>\n","    </tr>\n","    <tr>\n","      <th>12</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Grèce</td>\n","    </tr>\n","    <tr>\n","      <th>13</th>\n","      <td>Iannis Katsahnias</td>\n","      <td>http://fr.dbpedia.org/resource/Grèce</td>\n","    </tr>\n","    <tr>\n","      <th>14</th>\n","      <td>Tahar Djaout</td>\n","      <td>Algérienne</td>\n","    </tr>\n","    <tr>\n","      <th>15</th>\n","      <td></td>\n","      <td>Algérienne</td>\n","    </tr>\n","    <tr>\n","      <th>16</th>\n","      <td>Comprendre le Liban</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>17</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>18</th>\n","      <td>Danielle Charest</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>19</th>\n","      <td></td>\n","      <td>Libanaise</td>\n","    </tr>\n","    <tr>\n","      <th>20</th>\n","      <td>Maroun Bagdadi</td>\n","      <td>Libanaise</td>\n","    </tr>\n","    <tr>\n","      <th>21</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>22</th>\n","      <td>Bernard Simonay</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>23</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Algérie</td>\n","    </tr>\n","    <tr>\n","      <th>24</th>\n","      <td>Azzedine Meddour</td>\n","      <td>http://fr.dbpedia.org/resource/Algérie</td>\n","    </tr>\n","    <tr>\n","      <th>25</th>\n","      <td>Descente vers l'espoir</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>26</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>27</th>\n","      <td>Yamina Mechakra</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>28</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>29</th>\n","      <td>Dominique Dussidour</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>30</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>31</th>\n","      <td>Alexandre Amprimoz</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>32</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>33</th>\n","      <td>Philippe Flajolet</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>34</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>35</th>\n","      <td>Franck Langolff</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>36</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>37</th>\n","      <td>Joachim Sebastiano Valdez</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>38</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>39</th>\n","      <td>Richard Laymon</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>40</th>\n","      <td>Pascal Auriat</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>41</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>42</th>\n","      <td>Jacques Asklund</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>43</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>44</th>\n","      <td>Jaime Semprun</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>45</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/France</td>\n","    </tr>\n","    <tr>\n","      <th>46</th>\n","      <td>Alain Philippon</td>\n","      <td>http://fr.dbpedia.org/resource/France</td>\n","    </tr>\n","    <tr>\n","      <th>47</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>48</th>\n","      <td>Jacques Boireau</td>\n","      <td></td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                         name                             nationalite\n","0                                                                    \n","1             Philippe Nassif                                        \n","2                                                                    \n","3                Franck Krebs                                        \n","4                                                                    \n","5              Thierry Aprile                                        \n","6                                                                    \n","7            Emmanuel Jouanne                                        \n","8                                                                    \n","9               Bruno Fecteau                                        \n","10      Sebastian Santa Maria                                        \n","11                Mario Ramos                                   Belge\n","12                               http://fr.dbpedia.org/resource/Grèce\n","13          Iannis Katsahnias    http://fr.dbpedia.org/resource/Grèce\n","14               Tahar Djaout                              Algérienne\n","15                                                         Algérienne\n","16        Comprendre le Liban                                        \n","17                                                                   \n","18           Danielle Charest                                        \n","19                                                          Libanaise\n","20             Maroun Bagdadi                               Libanaise\n","21                                                                   \n","22            Bernard Simonay                                        \n","23                             http://fr.dbpedia.org/resource/Algérie\n","24           Azzedine Meddour  http://fr.dbpedia.org/resource/Algérie\n","25     Descente vers l'espoir                                        \n","26                                                                   \n","27            Yamina Mechakra                                        \n","28                                                                   \n","29        Dominique Dussidour                                        \n","30                                                                   \n","31         Alexandre Amprimoz                                        \n","32                                                                   \n","33          Philippe Flajolet                                        \n","34                                                                   \n","35            Franck Langolff                                        \n","36                                                                   \n","37  Joachim Sebastiano Valdez                                        \n","38                                                                   \n","39             Richard Laymon                                        \n","40              Pascal Auriat                                        \n","41                                                                   \n","42            Jacques Asklund                                        \n","43                                                                   \n","44              Jaime Semprun                                        \n","45                              http://fr.dbpedia.org/resource/France\n","46            Alain Philippon   http://fr.dbpedia.org/resource/France\n","47                                                                   \n","48            Jacques Boireau                                        "]},"execution_count":23,"metadata":{},"output_type":"execute_result"}],"source":["\n","requete_parametree = (\n","    DBPEDIA_prefix\n","    + \"\"\"\n","  SELECT distinct ?name ?nationalite ?interet ?idee\n","  WHERE { \n","    ?pers foaf:name ?name \n","    optional {?pers dbp:nationalité ?nationalite}\n","    optional {?pers dbo:mainInterest ?interet}\n","    optional {?pers dbp:idéesRemarquables ?idee}\n","\n","#      optional {?pers  dbp:œuvresPrincipales ?oeuvre}\n","#      optional {?pers  dbo:influencedBy ?influenceur}\n","    FILTER ( ?pers = <{PERSONNE}> ) \n","\n","  }\n","  order by ?p\n","  LIMIT 10\n","\"\"\"\n",")\n","\n","    # FILTER ( ?pers = <{PERSONNE}> ) \n","\n","res = []\n","for personne in personnes:\n","    DBPEDIA.setQuery(requete_parametree.replace(\"{PERSONNE}\", personne))\n","    D2 = DBPEDIA.query().bindings\n","    res += D2\n","\n","afficherResultat(res)\n"]},{"cell_type":"markdown","metadata":{"id":"BJm4deKz_UAv"},"source":["### J2 : Pour une année N afficher la liste des personnes qui sont nées l'année N et qui existent à la fois dans la BNF et dans DBPedia.\n","Proposer une solution par fusion de deux résultats triés"]},{"cell_type":"code","execution_count":24,"metadata":{"id":"WUlkb4_-6-r_"},"outputs":[{"name":"stdout","output_type":"stream","text":["123 éléments\n","schéma:  ['nom', 'auteurDbpedia', 'naissance']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>nom</th>\n","      <th>auteurDbpedia</th>\n","      <th>naissance</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Robert de La Rochefoucauld</td>\n","      <td>http://fr.dbpedia.org/resource/Robert_de_La_Rochefoucauld</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Paul Cuvelier</td>\n","      <td>http://fr.dbpedia.org/resource/Paul_Cuvelier</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Jean Deprun</td>\n","      <td>http://fr.dbpedia.org/resource/Jean_Deprun</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Denise Levertov</td>\n","      <td>http://fr.dbpedia.org/resource/Denise_Levertov</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Meng-Hua Ho</td>\n","      <td>http://fr.dbpedia.org/resource/Ho_Meng-hua</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>...</th>\n","      <td>...</td>\n","      <td>...</td>\n","      <td>...</td>\n","    </tr>\n","    <tr>\n","      <th>95</th>\n","      <td>Renato Polese</td>\n","      <td>http://fr.dbpedia.org/resource/Renato_Polese</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>96</th>\n","      <td>Martha Schlamme</td>\n","      <td>http://fr.dbpedia.org/resource/Martha_Schlamme</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>97</th>\n","      <td>Seydou Keita</td>\n","      <td>http://fr.dbpedia.org/resource/Seydou_Ke%C3%AFta_%28photographe%29</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>98</th>\n","      <td>Jean Darnel</td>\n","      <td>http://fr.dbpedia.org/resource/Jean_Darnel</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>99</th>\n","      <td>Jean Bousquet</td>\n","      <td>http://fr.dbpedia.org/resource/Jean_Bousquet_%28acteur%29</td>\n","      <td>1923</td>\n","    </tr>\n","  </tbody>\n","</table>\n","<p>100 rows × 3 columns</p>\n","</div>"],"text/plain":["                           nom  \\\n","0   Robert de La Rochefoucauld   \n","1                Paul Cuvelier   \n","2                  Jean Deprun   \n","3              Denise Levertov   \n","4                  Meng-Hua Ho   \n","..                         ...   \n","95               Renato Polese   \n","96             Martha Schlamme   \n","97                Seydou Keita   \n","98                 Jean Darnel   \n","99               Jean Bousquet   \n","\n","                                                         auteurDbpedia  \\\n","0            http://fr.dbpedia.org/resource/Robert_de_La_Rochefoucauld   \n","1                         http://fr.dbpedia.org/resource/Paul_Cuvelier   \n","2                           http://fr.dbpedia.org/resource/Jean_Deprun   \n","3                       http://fr.dbpedia.org/resource/Denise_Levertov   \n","4                           http://fr.dbpedia.org/resource/Ho_Meng-hua   \n","..                                                                 ...   \n","95                        http://fr.dbpedia.org/resource/Renato_Polese   \n","96                      http://fr.dbpedia.org/resource/Martha_Schlamme   \n","97  http://fr.dbpedia.org/resource/Seydou_Ke%C3%AFta_%28photographe%29   \n","98                          http://fr.dbpedia.org/resource/Jean_Darnel   \n","99           http://fr.dbpedia.org/resource/Jean_Bousquet_%28acteur%29   \n","\n","   naissance  \n","0       1923  \n","1       1923  \n","2       1923  \n","3       1923  \n","4       1923  \n","..       ...  \n","95      1923  \n","96      1923  \n","97      1923  \n","98      1923  \n","99      1923  \n","\n","[100 rows x 3 columns]"]},"execution_count":24,"metadata":{},"output_type":"execute_result"}],"source":["# A compléter\n","annee = 1923\n","\n","req1 = (\n","    BNF_prefix\n","    + \"\"\"\n","SELECT distinct ?nom ?auteurDbpedia ?naissance\n","WHERE {\n","?auteur foaf:name ?nom ; bio:birth ?naissance .\n","?auteur owl:sameAs ?auteurDbpedia .\n","FILTER (regex(?auteurDbpedia, \"http://fr.dbpedia.org\")\n","        && xsd:integer(?naissance) = '{ANNEE}'^^xsd:integer )\n","}\n","ORDER BY desc(?naissance)\n","LIMIT 1000\n","\"\"\"\n",")\n","\n","BNF.setQuery(req1.replace(\"{ANNEE}\", str(annee)))\n","res1 = BNF.query().bindings\n","df1 = pd.DataFrame(res1).map(lambda x: x.value)\n","\n","afficherResultat(res1)\n"]},{"cell_type":"code","execution_count":32,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["1437 éléments\n","schéma:  ['p', 'naissance']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>p</th>\n","      <th>naissance</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>http://fr.dbpedia.org/resource/Ștefan_Stănculescu</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>http://fr.dbpedia.org/resource/Aage_Larsen</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>http://fr.dbpedia.org/resource/Aaron_Antonovsky</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>http://fr.dbpedia.org/resource/Abdelaziz_Benabdallah</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>http://fr.dbpedia.org/resource/Abdelaziz_Bouraoui</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>...</th>\n","      <td>...</td>\n","      <td>...</td>\n","    </tr>\n","    <tr>\n","      <th>95</th>\n","      <td>http://fr.dbpedia.org/resource/Anne_Shelton_(chanteuse)</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>96</th>\n","      <td>http://fr.dbpedia.org/resource/Anne_de_Bourbon-Parme</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>97</th>\n","      <td>http://fr.dbpedia.org/resource/Antal_Bánkúti</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>98</th>\n","      <td>http://fr.dbpedia.org/resource/Anthony_Joseph_Bevilacqua</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>99</th>\n","      <td>http://fr.dbpedia.org/resource/Anthony_Noel_(5e_comte_de_Gainsborough)</td>\n","      <td>1923</td>\n","    </tr>\n","  </tbody>\n","</table>\n","<p>100 rows × 2 columns</p>\n","</div>"],"text/plain":["                                                                         p  \\\n","0                        http://fr.dbpedia.org/resource/Ștefan_Stănculescu   \n","1                               http://fr.dbpedia.org/resource/Aage_Larsen   \n","2                          http://fr.dbpedia.org/resource/Aaron_Antonovsky   \n","3                     http://fr.dbpedia.org/resource/Abdelaziz_Benabdallah   \n","4                        http://fr.dbpedia.org/resource/Abdelaziz_Bouraoui   \n","..                                                                     ...   \n","95                 http://fr.dbpedia.org/resource/Anne_Shelton_(chanteuse)   \n","96                    http://fr.dbpedia.org/resource/Anne_de_Bourbon-Parme   \n","97                            http://fr.dbpedia.org/resource/Antal_Bánkúti   \n","98                http://fr.dbpedia.org/resource/Anthony_Joseph_Bevilacqua   \n","99  http://fr.dbpedia.org/resource/Anthony_Noel_(5e_comte_de_Gainsborough)   \n","\n","   naissance  \n","0       1923  \n","1       1923  \n","2       1923  \n","3       1923  \n","4       1923  \n","..       ...  \n","95      1923  \n","96      1923  \n","97      1923  \n","98      1923  \n","99      1923  \n","\n","[100 rows x 2 columns]"]},"execution_count":32,"metadata":{},"output_type":"execute_result"}],"source":["req2 = (\n","    DBPEDIA_prefix\n","    + \"\"\"\n","  SELECT distinct ?p year(xsd:dateTime(?naissance)) as ?naissance\n","  WHERE { \n","    ?p a dbo:Person .\n","    ?p dbo:birthDate ?naissance\n","    FILTER ( regex (?naissance, '{ANNEE}') )\n","  }\n","  ORDER BY desc(?naissance)\n","  LIMIT 10000\n","\"\"\"\n",")\n","\n","DBPEDIA.setQuery(req2.replace(\"{ANNEE}\", str(annee)))\n","res2 = DBPEDIA.query().bindings\n","df2 = pd.DataFrame(res2).map(lambda x: x.value)\n","\n","afficherResultat(res2)\n"]},{"cell_type":"code","execution_count":26,"metadata":{},"outputs":[{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>nom</th>\n","      <th>auteurDbpedia</th>\n","      <th>naissance_x</th>\n","      <th>p</th>\n","      <th>naissance_y</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Paul Cuvelier</td>\n","      <td>http://fr.dbpedia.org/resource/Paul_Cuvelier</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Paul_Cuvelier</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Denise Levertov</td>\n","      <td>http://fr.dbpedia.org/resource/Denise_Levertov</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Denise_Levertov</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Meng-Hua Ho</td>\n","      <td>http://fr.dbpedia.org/resource/Ho_Meng-hua</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Ho_Meng-hua</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Robert Soulat</td>\n","      <td>http://fr.dbpedia.org/resource/Robert_Soulat</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Robert_Soulat</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Cyril M. Kornbluth</td>\n","      <td>http://fr.dbpedia.org/resource/Cyril_M._Kornbluth</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Cyril_M._Kornbluth</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>Simon Eisner</td>\n","      <td>http://fr.dbpedia.org/resource/Cyril_M._Kornbluth</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Cyril_M._Kornbluth</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>Kildare Dobbs</td>\n","      <td>http://fr.dbpedia.org/resource/Kildare_Dobbs</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Kildare_Dobbs</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Richard Wyler</td>\n","      <td>http://fr.dbpedia.org/resource/Richard_Stapley</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Richard_Stapley</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>Piera Aulagnier</td>\n","      <td>http://fr.dbpedia.org/resource/Piera_Aulagnier</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Piera_Aulagnier</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>Urbano Tavares Rodrigues</td>\n","      <td>http://fr.dbpedia.org/resource/Urbano_Tavares_Rodrigues</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Urbano_Tavares_Rodrigues</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>10</th>\n","      <td>Rasul Gamzatovič Gamzatov</td>\n","      <td>http://fr.dbpedia.org/resource/Rassoul_Gamzatov</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Rassoul_Gamzatov</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>11</th>\n","      <td>Yervant Gobelyan</td>\n","      <td>http://fr.dbpedia.org/resource/Yervant_Gobelyan</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Yervant_Gobelyan</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>12</th>\n","      <td>Herbert John Ryser</td>\n","      <td>http://fr.dbpedia.org/resource/Herbert_John_Ryser</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Herbert_John_Ryser</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>13</th>\n","      <td>Philippe Paumelle</td>\n","      <td>http://fr.dbpedia.org/resource/Philippe_Paumelle</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Philippe_Paumelle</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>14</th>\n","      <td>Édith Reffet</td>\n","      <td>http://fr.dbpedia.org/resource/Edith_Reffet</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Edith_Reffet</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>15</th>\n","      <td>Pierre Courcel</td>\n","      <td>http://fr.dbpedia.org/resource/Pierre_Courcel</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Pierre_Courcel</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>16</th>\n","      <td>Pierre Naudin</td>\n","      <td>http://fr.dbpedia.org/resource/Pierre_Naudin</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Pierre_Naudin</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>17</th>\n","      <td>Jean Clavreul</td>\n","      <td>http://fr.dbpedia.org/resource/Jean_Clavreul</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Jean_Clavreul</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>18</th>\n","      <td>Michela Schiff Giorgini</td>\n","      <td>http://fr.dbpedia.org/resource/Michela_Schiff_Giorgini</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Michela_Schiff_Giorgini</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>19</th>\n","      <td>Plinio Martini</td>\n","      <td>http://fr.dbpedia.org/resource/Plinio_Martini</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Plinio_Martini</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>20</th>\n","      <td>Bruno Paolinelli</td>\n","      <td>http://fr.dbpedia.org/resource/Bruno_Paolinelli</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Bruno_Paolinelli</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>21</th>\n","      <td>Martha Schlamme</td>\n","      <td>http://fr.dbpedia.org/resource/Martha_Schlamme</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Martha_Schlamme</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>22</th>\n","      <td>Ana Mariscal</td>\n","      <td>http://fr.dbpedia.org/resource/Ana_Mariscal</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Ana_Mariscal</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>23</th>\n","      <td>Patrick J. Hillery</td>\n","      <td>http://fr.dbpedia.org/resource/Patrick_Hillery</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Patrick_Hillery</td>\n","      <td>1923</td>\n","    </tr>\n","    <tr>\n","      <th>24</th>\n","      <td>ʿĀṣī al- Raḥbānī</td>\n","      <td>http://fr.dbpedia.org/resource/Assy_Rahbani</td>\n","      <td>1923</td>\n","      <td>http://fr.dbpedia.org/resource/Assy_Rahbani</td>\n","      <td>1923</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                          nom  \\\n","0               Paul Cuvelier   \n","1             Denise Levertov   \n","2                 Meng-Hua Ho   \n","3               Robert Soulat   \n","4          Cyril M. Kornbluth   \n","5                Simon Eisner   \n","6               Kildare Dobbs   \n","7               Richard Wyler   \n","8             Piera Aulagnier   \n","9    Urbano Tavares Rodrigues   \n","10  Rasul Gamzatovič Gamzatov   \n","11           Yervant Gobelyan   \n","12         Herbert John Ryser   \n","13          Philippe Paumelle   \n","14               Édith Reffet   \n","15             Pierre Courcel   \n","16              Pierre Naudin   \n","17              Jean Clavreul   \n","18    Michela Schiff Giorgini   \n","19             Plinio Martini   \n","20           Bruno Paolinelli   \n","21            Martha Schlamme   \n","22               Ana Mariscal   \n","23         Patrick J. Hillery   \n","24         ʿĀṣī al- Raḥbānī   \n","\n","                                              auteurDbpedia naissance_x  \\\n","0              http://fr.dbpedia.org/resource/Paul_Cuvelier        1923   \n","1            http://fr.dbpedia.org/resource/Denise_Levertov        1923   \n","2                http://fr.dbpedia.org/resource/Ho_Meng-hua        1923   \n","3              http://fr.dbpedia.org/resource/Robert_Soulat        1923   \n","4         http://fr.dbpedia.org/resource/Cyril_M._Kornbluth        1923   \n","5         http://fr.dbpedia.org/resource/Cyril_M._Kornbluth        1923   \n","6              http://fr.dbpedia.org/resource/Kildare_Dobbs        1923   \n","7            http://fr.dbpedia.org/resource/Richard_Stapley        1923   \n","8            http://fr.dbpedia.org/resource/Piera_Aulagnier        1923   \n","9   http://fr.dbpedia.org/resource/Urbano_Tavares_Rodrigues        1923   \n","10          http://fr.dbpedia.org/resource/Rassoul_Gamzatov        1923   \n","11          http://fr.dbpedia.org/resource/Yervant_Gobelyan        1923   \n","12        http://fr.dbpedia.org/resource/Herbert_John_Ryser        1923   \n","13         http://fr.dbpedia.org/resource/Philippe_Paumelle        1923   \n","14              http://fr.dbpedia.org/resource/Edith_Reffet        1923   \n","15            http://fr.dbpedia.org/resource/Pierre_Courcel        1923   \n","16             http://fr.dbpedia.org/resource/Pierre_Naudin        1923   \n","17             http://fr.dbpedia.org/resource/Jean_Clavreul        1923   \n","18   http://fr.dbpedia.org/resource/Michela_Schiff_Giorgini        1923   \n","19            http://fr.dbpedia.org/resource/Plinio_Martini        1923   \n","20          http://fr.dbpedia.org/resource/Bruno_Paolinelli        1923   \n","21           http://fr.dbpedia.org/resource/Martha_Schlamme        1923   \n","22              http://fr.dbpedia.org/resource/Ana_Mariscal        1923   \n","23           http://fr.dbpedia.org/resource/Patrick_Hillery        1923   \n","24              http://fr.dbpedia.org/resource/Assy_Rahbani        1923   \n","\n","                                                          p naissance_y  \n","0              http://fr.dbpedia.org/resource/Paul_Cuvelier        1923  \n","1            http://fr.dbpedia.org/resource/Denise_Levertov        1923  \n","2                http://fr.dbpedia.org/resource/Ho_Meng-hua        1923  \n","3              http://fr.dbpedia.org/resource/Robert_Soulat        1923  \n","4         http://fr.dbpedia.org/resource/Cyril_M._Kornbluth        1923  \n","5         http://fr.dbpedia.org/resource/Cyril_M._Kornbluth        1923  \n","6              http://fr.dbpedia.org/resource/Kildare_Dobbs        1923  \n","7            http://fr.dbpedia.org/resource/Richard_Stapley        1923  \n","8            http://fr.dbpedia.org/resource/Piera_Aulagnier        1923  \n","9   http://fr.dbpedia.org/resource/Urbano_Tavares_Rodrigues        1923  \n","10          http://fr.dbpedia.org/resource/Rassoul_Gamzatov        1923  \n","11          http://fr.dbpedia.org/resource/Yervant_Gobelyan        1923  \n","12        http://fr.dbpedia.org/resource/Herbert_John_Ryser        1923  \n","13         http://fr.dbpedia.org/resource/Philippe_Paumelle        1923  \n","14              http://fr.dbpedia.org/resource/Edith_Reffet        1923  \n","15            http://fr.dbpedia.org/resource/Pierre_Courcel        1923  \n","16             http://fr.dbpedia.org/resource/Pierre_Naudin        1923  \n","17             http://fr.dbpedia.org/resource/Jean_Clavreul        1923  \n","18   http://fr.dbpedia.org/resource/Michela_Schiff_Giorgini        1923  \n","19            http://fr.dbpedia.org/resource/Plinio_Martini        1923  \n","20          http://fr.dbpedia.org/resource/Bruno_Paolinelli        1923  \n","21           http://fr.dbpedia.org/resource/Martha_Schlamme        1923  \n","22              http://fr.dbpedia.org/resource/Ana_Mariscal        1923  \n","23           http://fr.dbpedia.org/resource/Patrick_Hillery        1923  \n","24              http://fr.dbpedia.org/resource/Assy_Rahbani        1923  "]},"execution_count":26,"metadata":{},"output_type":"execute_result"}],"source":["df1.merge(df2, left_on=\"auteurDbpedia\", right_on=\"p\")"]},{"cell_type":"markdown","metadata":{"id":"JlhisyTGGtZ0"},"source":["### J3 : Quels sont les auteurs d'une oeuvre dont le thème est philosophie (dans la BNF) et qui sont référencés comme étant des philosophes dans DBpedia ?"]},{"cell_type":"code","execution_count":27,"metadata":{"id":"2UOmwMuJ7BN2"},"outputs":[],"source":["# A compléter"]},{"cell_type":"markdown","metadata":{"id":"IfWr1BEYrt-M"},"source":["# Exercice 2 : Accès aux données par des requêtes de sélections\n","L'objectif de cet exercice est d'appréhender la situation où l'accès aux données est contraint (voir la notion de [linked data fragment](https://linkeddatafragments.org/concept/)). Le point d'accès n'autorise que des requêtes simples (donc peut coûteuses à traiter) qui ne contiennent que des **sélections**. La clause where d'une requête ne peut contenir qu'**un seul** motif ayant 1 ou 2 variables. Les motifs autorisés sont donc parmi :\n","*   ?a *propriété* ?b *(cette requête a deux variables)*\n","*   *A* *propriété* ?b  *(cette requête a une seule variable)*\n","*   ?a *propriété* *B*  \n","\n","où ?a et ?b sont des variables et *A*, *B* et *propriété* sont des valeurs fixées avant de poser la requête.\n","\n","Ainsi, toutes les jointures doivent être exprimées par le client qui accède aux données : vous devez \"programmer\" toutes les jointures en python.\n","Pour les requêtes D1 et D6 proposer une solution respectant ce mode d'accès."]},{"cell_type":"code","execution_count":28,"metadata":{},"outputs":[],"source":["# pip install tabulate"]},{"cell_type":"code","execution_count":29,"metadata":{"id":"leYOriLyOBnb"},"outputs":[],"source":["# # à compléter\n","# from SPARQLWrapper import SPARQLWrapper, JSON\n","# from tabulate import tabulate\n","# # Définir l'URL du point d'accès DBpedia\n","# DBPEDIA_prefix = \"http://dbpedia.org/sparql\"\n","\n","# # Définir l'objet SPARQLWrapper pour le point d'accès DBpedia\n","# DBPEDIA = SPARQLWrapper(DBPEDIA_prefix)\n","# DBPEDIA.setReturnFormat(JSON)\n","\n","# # Fonction pour effectuer une requête simple et récupérer les résultats\n","# def effectuer_requete(requete):\n","#     DBPEDIA.setQuery(requete)\n","#     res = DBPEDIA.query().convert()\n","#     return res['results']['bindings']\n","\n","# # Requête principale pour récupérer les informations de base sur les personnes\n","# requete_principale = \"\"\"\n","# SELECT ?p ?name ?naissance\n","# WHERE {\n","#   ?p a dbo:Person .\n","#   ?p foaf:name ?name .\n","#   ?p dbo:birthDate ?naissance\n","#   FILTER (regex(?name, \"{MOTIF}\", \"i\"))\n","# }\n","# LIMIT 10\n","# \"\"\"\n","\n","# # Remplacer le motif dans la requête principale\n","# motif = \"Victor.*Hug\"\n","# requete_principale = requete_principale.replace(\"{MOTIF}\", motif)\n","\n","# # Effectuer la requête principale en utilisant la fonction effectuer_requete\n","# resultats_principaux = effectuer_requete(requete_principale)\n","\n","# # Liste pour stocker les résultats complets\n","# resultats_complets = []\n","\n","# # Parcourir les résultats principaux pour récupérer les informations supplémentaires\n","# for resultat in resultats_principaux:\n","#     personne = {\n","#         'p': resultat['p']['value'],\n","#         'name': resultat['name']['value'],\n","#         'naissance': resultat['naissance']['value']\n","#     }\n","    \n","#     # Requêtes supplémentaires pour récupérer la nationalité, la profession et le lieu de naissance\n","#     requete_nationalite = f\"\"\"\n","#     SELECT ?nationalité WHERE {{\n","#       <{personne['p']}> dbp:nationalité ?nationalité\n","#     }}\n","#     \"\"\"\n","#     requete_profession = f\"\"\"\n","#     SELECT ?profession WHERE {{\n","#       <{personne['p']}> dbp:profession ?profession\n","#     }}\n","#     \"\"\"\n","#     requete_lieu_naissance = f\"\"\"\n","#     SELECT ?lieu WHERE {{\n","#       <{personne['p']}> dbp:lieuDeNaissance ?lieu\n","#     }}\n","#     \"\"\"\n","    \n","#     # Exécuter les requêtes supplémentaires et ajouter les informations au dictionnaire de la personne\n","#     nationalite = effectuer_requete(requete_nationalite)\n","#     profession = effectuer_requete(requete_profession)\n","#     lieu_naissance = effectuer_requete(requete_lieu_naissance)\n","    \n","#     if nationalite:\n","#         personne['nationalité'] = nationalite[0]['nationalité']['value']\n","#     else:\n","#         personne['nationalité'] = None\n","        \n","#     if profession:\n","#         personne['profession'] = profession[0]['profession']['value']\n","#     else:\n","#         personne['profession'] = None\n","        \n","#     if lieu_naissance:\n","#         personne['lieu'] = lieu_naissance[0]['lieu']['value']\n","#     else:\n","#         personne['lieu'] = None\n","        \n","#     resultats_complets.append(personne)\n","\n","# # Afficher les résultats complets sous forme tabulaire\n","# print(tabulate(resultats_complets, headers=\"keys\", tablefmt=\"grid\"))"]},{"cell_type":"markdown","metadata":{"id":"Mh8Nx-7nH_Jg"},"source":["# Exercice 3 : Accès par morceau au résultat d'une requête\n","1) Un utilisateur veut accéder aux données de manière progressive. Proposer une solution pour obtenir le resultat d'une requete par morceau de N tuples, en utilisant les mots-clés OFFSET et LIMIT. Appliquer cela pour lire le résultat de la requête qui affiche le nom des personnes existant dans dbpedia.\n","Etudier l'influence de l'offset et de la taille du résultat sur le temps de réponse de la requête.\n","\n"]},{"cell_type":"code","execution_count":30,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":415},"executionInfo":{"elapsed":818,"status":"ok","timestamp":1711658044821,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"_CH0X6N4634a","outputId":"ae0a21ed-2366-4516-8d97-b97dadc3fcd2"},"outputs":[{"name":"stdout","output_type":"stream","text":["la requête dure 108 ms\n","10 éléments\n","schéma:  ['p', 'name']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>p</th>\n","      <th>name</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>http://fr.dbpedia.org/resource/Alina_Alexandra_Dumitru</td>\n","      <td>Alina Alexandra Dumitru</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>http://fr.dbpedia.org/resource/Alina_Astafei</td>\n","      <td>Alina Astafei</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>http://fr.dbpedia.org/resource/Alina_Azario</td>\n","      <td>Alina Azario</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>http://fr.dbpedia.org/resource/Alina_Berchakova</td>\n","      <td>Alina Berchakova</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>http://fr.dbpedia.org/resource/Alina_Berezhna</td>\n","      <td>Alina Berezhna</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>http://fr.dbpedia.org/resource/Alina_Dumitrescu</td>\n","      <td>Alina Dumitrescu</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>http://fr.dbpedia.org/resource/Alina_Elizarova</td>\n","      <td>Alina Elizarova</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>http://fr.dbpedia.org/resource/Alina_Freund</td>\n","      <td>Alina Freund</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>http://fr.dbpedia.org/resource/Alina_Fyodorova</td>\n","      <td>Alina Fyodorova</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>http://fr.dbpedia.org/resource/Alina_Goreac</td>\n","      <td>Alina Goreac</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                                                        p  \\\n","0  http://fr.dbpedia.org/resource/Alina_Alexandra_Dumitru   \n","1            http://fr.dbpedia.org/resource/Alina_Astafei   \n","2             http://fr.dbpedia.org/resource/Alina_Azario   \n","3         http://fr.dbpedia.org/resource/Alina_Berchakova   \n","4           http://fr.dbpedia.org/resource/Alina_Berezhna   \n","5         http://fr.dbpedia.org/resource/Alina_Dumitrescu   \n","6          http://fr.dbpedia.org/resource/Alina_Elizarova   \n","7             http://fr.dbpedia.org/resource/Alina_Freund   \n","8          http://fr.dbpedia.org/resource/Alina_Fyodorova   \n","9             http://fr.dbpedia.org/resource/Alina_Goreac   \n","\n","                      name  \n","0  Alina Alexandra Dumitru  \n","1            Alina Astafei  \n","2             Alina Azario  \n","3         Alina Berchakova  \n","4           Alina Berezhna  \n","5         Alina Dumitrescu  \n","6          Alina Elizarova  \n","7             Alina Freund  \n","8          Alina Fyodorova  \n","9             Alina Goreac  "]},"execution_count":30,"metadata":{},"output_type":"execute_result"}],"source":["# Exemple d'utilisation de OFFSET et LIMIT\n","\n","# Compléter cet exemple\n","\n","\n","import time\n","\n","requete = DBPEDIA_prefix + \"\"\"\n","\n","SELECT distinct ?p ?name\n","WHERE {\n","  ?p rdf:type dbo:Person .\n","  ?p foaf:name ?name\n","  FILTER(  STRLEN(?name) != 0)\n","}\n","# ORDER BY ?p ?name\n","offset 10000 limit 10\n","\"\"\"\n","\n","start_time = time.time()\n","# exécution de la requête\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","duree = int ( (time.time() - start_time) * 1000)\n","print(f\"la requête dure {duree} ms\")\n","\n","afficherResultat(res)"]},{"cell_type":"code","execution_count":31,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n","10 éléments\n","schéma:  ['p', 'name']\n"]},{"ename":"KeyboardInterrupt","evalue":"","output_type":"error","traceback":["\u001b[0;31m---------------------------------------------------------------------------\u001b[0m","\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)","\u001b[0;32m/tmp/ipykernel_24068/3322033204.py\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m     26\u001b[0m     \u001b[0;31m# Exécution de la requête\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     27\u001b[0m     \u001b[0mDBPEDIA\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msetQuery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrequete_modifiee\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 28\u001b[0;31m     \u001b[0mres\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mDBPEDIA\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbindings\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     29\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     30\u001b[0m     \u001b[0;31m# Affichage des résultats\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m~/.local/lib/python3.10/site-packages/SPARQLWrapper/SmartWrapper.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    344\u001b[0m         \u001b[0;34m:\u001b[0m\u001b[0mrtype\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0;34m:\u001b[0m\u001b[0;32mclass\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;31m`\u001b[0m\u001b[0mBindings\u001b[0m\u001b[0;31m`\u001b[0m \u001b[0minstance\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    345\u001b[0m         \"\"\"\n\u001b[0;32m--> 346\u001b[0;31m         \u001b[0mres\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msuper\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mSPARQLWrapper2\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    347\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    348\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mqueryType\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0mSELECT\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m~/.local/lib/python3.10/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    958\u001b[0m         \u001b[0;34m:\u001b[0m\u001b[0mrtype\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0;34m:\u001b[0m\u001b[0;32mclass\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;31m`\u001b[0m\u001b[0mQueryResult\u001b[0m\u001b[0;31m`\u001b[0m \u001b[0minstance\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    959\u001b[0m         \"\"\"\n\u001b[0;32m--> 960\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mQueryResult\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_query\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    961\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    962\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mqueryAndConvert\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m->\u001b[0m \u001b[0;34m\"QueryResult.ConvertResult\"\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m~/.local/lib/python3.10/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36m_query\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    924\u001b[0m                 \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0murlopener\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtimeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    925\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 926\u001b[0;31m                 \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0murlopener\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    927\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mreturnFormat\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    928\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0murllib\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mHTTPError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/urllib/request.py\u001b[0m in \u001b[0;36murlopen\u001b[0;34m(url, data, timeout, cafile, capath, cadefault, context)\u001b[0m\n\u001b[1;32m    214\u001b[0m     \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    215\u001b[0m         \u001b[0mopener\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0m_opener\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 216\u001b[0;31m     \u001b[0;32mreturn\u001b[0m \u001b[0mopener\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mopen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    217\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    218\u001b[0m \u001b[0;32mdef\u001b[0m \u001b[0minstall_opener\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mopener\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/urllib/request.py\u001b[0m in \u001b[0;36mopen\u001b[0;34m(self, fullurl, data, timeout)\u001b[0m\n\u001b[1;32m    517\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    518\u001b[0m         \u001b[0msys\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0maudit\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'urllib.Request'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfull_url\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdata\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mheaders\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget_method\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 519\u001b[0;31m         \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_open\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    520\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    521\u001b[0m         \u001b[0;31m# post-process response\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/urllib/request.py\u001b[0m in \u001b[0;36m_open\u001b[0;34m(self, req, data)\u001b[0m\n\u001b[1;32m    534\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    535\u001b[0m         \u001b[0mprotocol\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtype\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 536\u001b[0;31m         result = self._call_chain(self.handle_open, protocol, protocol +\n\u001b[0m\u001b[1;32m    537\u001b[0m                                   '_open', req)\n\u001b[1;32m    538\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/urllib/request.py\u001b[0m in \u001b[0;36m_call_chain\u001b[0;34m(self, chain, kind, meth_name, *args)\u001b[0m\n\u001b[1;32m    494\u001b[0m         \u001b[0;32mfor\u001b[0m \u001b[0mhandler\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mhandlers\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    495\u001b[0m             \u001b[0mfunc\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 496\u001b[0;31m             \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    497\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mresult\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    498\u001b[0m                 \u001b[0;32mreturn\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/urllib/request.py\u001b[0m in \u001b[0;36mhttp_open\u001b[0;34m(self, req)\u001b[0m\n\u001b[1;32m   1375\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1376\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mhttp_open\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1377\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdo_open\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhttp\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mclient\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mHTTPConnection\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1378\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1379\u001b[0m     \u001b[0mhttp_request\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mAbstractHTTPHandler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdo_request_\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/urllib/request.py\u001b[0m in \u001b[0;36mdo_open\u001b[0;34m(self, http_class, req, **http_conn_args)\u001b[0m\n\u001b[1;32m   1350\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mOSError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merr\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0;31m# timeout error\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1351\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0mURLError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merr\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1352\u001b[0;31m             \u001b[0mr\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mh\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mgetresponse\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1353\u001b[0m         \u001b[0;32mexcept\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1354\u001b[0m             \u001b[0mh\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mclose\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/http/client.py\u001b[0m in \u001b[0;36mgetresponse\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m   1373\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1374\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1375\u001b[0;31m                 \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbegin\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1376\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mConnectionError\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1377\u001b[0m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mclose\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/http/client.py\u001b[0m in \u001b[0;36mbegin\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    316\u001b[0m         \u001b[0;31m# read until we get a non-100 response\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    317\u001b[0m         \u001b[0;32mwhile\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 318\u001b[0;31m             \u001b[0mversion\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstatus\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreason\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_read_status\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    319\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mstatus\u001b[0m \u001b[0;34m!=\u001b[0m \u001b[0mCONTINUE\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    320\u001b[0m                 \u001b[0;32mbreak\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/http/client.py\u001b[0m in \u001b[0;36m_read_status\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    277\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    278\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_read_status\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 279\u001b[0;31m         \u001b[0mline\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mstr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfp\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mreadline\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0m_MAXLINE\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"iso-8859-1\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    280\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mlen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mline\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m>\u001b[0m \u001b[0m_MAXLINE\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    281\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mLineTooLong\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"status line\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/socket.py\u001b[0m in \u001b[0;36mreadinto\u001b[0;34m(self, b)\u001b[0m\n\u001b[1;32m    703\u001b[0m         \u001b[0;32mwhile\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    704\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 705\u001b[0;31m                 \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_sock\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrecv_into\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mb\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    706\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    707\u001b[0m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_timeout_occurred\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;31mKeyboardInterrupt\u001b[0m: "]}],"source":["import time\n","\n","# Définition de la requête SPARQL avec OFFSET et LIMIT\n","requete = DBPEDIA_prefix + \"\"\"\n","SELECT distinct ?p ?name\n","WHERE {\n","  ?p rdf:type dbo:Person .\n","  ?p foaf:name ?name\n","  FILTER(STRLEN(?name) != 0)\n","}\n","ORDER BY ?p ?name\n","OFFSET {OFFSET} LIMIT {LIMIT}\n","\"\"\"\n","\n","# Paramètres pour contrôler le nombre de tuples récupérés à chaque étape\n","OFFSET = 0  # Début à partir de la première ligne\n","LIMIT = 10  # Nombre de tuples à récupérer à chaque étape\n","\n","start_time = time.time()\n","\n","# Boucle pour lire les données progressivement\n","while True:\n","    # Modification de la requête avec les valeurs d'OFFSET et de LIMIT\n","    requete_modifiee = requete.replace(\"{OFFSET}\", str(OFFSET)).replace(\"{LIMIT}\", str(LIMIT))\n","\n","    # Exécution de la requête\n","    DBPEDIA.setQuery(requete_modifiee)\n","    res = DBPEDIA.query().bindings\n","    \n","    # Affichage des résultats\n","    afficherResultat(res)\n","    \n","    # Vérification s'il y a plus de données à récupérer\n","    if len(res) < LIMIT:\n","        break\n","    \n","    # Mise à jour de l'OFFSET pour la prochaine itération\n","    OFFSET += LIMIT\n","\n","# Calcul de la durée totale d'exécution de la requête\n","duree = int((time.time() - start_time) * 1000)\n","print(f\"La requête a duré {duree} ms\")\n"]},{"cell_type":"markdown","metadata":{"id":"aG1nFEdcmuJp"},"source":["2) Définir une fonction traiteRequete(requete) qui retourne un generateur sur une requete de telle sorte que la requete soit lue par morceaux de N tuples et que seuls les morceaux permettant de produire les M lignes demandées par l'utlisateur soit lus. On ne connait pas à l'avance le nombre M de lignes que va lire l'utilisateur. On a M > N.\n","Indication voir le mot clé python **yield** pour retourner un générateur."]},{"cell_type":"code","execution_count":33,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":601,"status":"ok","timestamp":1711658190023,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-60},"id":"1Bsz18LDn1yI","outputId":"7df28ed2-46c0-49c8-d004-b192c6e3b415"},"outputs":[{"ename":"QueryBadFormed","evalue":"QueryBadFormed: A bad request has been sent to the endpoint: probably the SPARQL query is badly formed. \n\nResponse:\nb'Virtuoso 37000 Error SP030: SPARQL compiler, line 24: syntax error at \\'OFFSET\\' before \\'0\\'\\n\\nSPARQL query:\\ndefine sql:big-data-const 0\\n#output-format:application/sparql-results+json\\nDEFINE sql:describe-mode \"CBD\"\\n\\nPREFIX dc:   <http://purl.org/dc/terms/>\\nPREFIX xsd:  <http://www.w3.org/2001/XMLSchema#>\\n\\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\\nPREFIX rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\n\\nPREFIX dbo:  <http://dbpedia.org/ontology/>\\n\\n# Dans cette source, les noms de propri\\xc3\\xa9t\\xc3\\xa9s sont en fran\\xc3\\xa7ais\\nPREFIX dbp:  <http://fr.dbpedia.org/property/>\\n\\nSELECT distinct ?name ?p\\nWHERE {\\n  ?p rdf:type dbo:Person .\\n  ?p foaf:name ?name\\n  FILTER(  STRLEN(?name) != 0)\\n}\\nOFFSET 0 LIMIT 10\\n OFFSET 0 LIMIT 10'","output_type":"error","traceback":["\u001b[0;31m---------------------------------------------------------------------------\u001b[0m","\u001b[0;31mHTTPError\u001b[0m                                 Traceback (most recent call last)","\u001b[0;32m~/.local/lib/python3.10/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36m_query\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    925\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 926\u001b[0;31m                 \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0murlopener\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    927\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mreturnFormat\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/urllib/request.py\u001b[0m in \u001b[0;36murlopen\u001b[0;34m(url, data, timeout, cafile, capath, cadefault, context)\u001b[0m\n\u001b[1;32m    215\u001b[0m         \u001b[0mopener\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0m_opener\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 216\u001b[0;31m     \u001b[0;32mreturn\u001b[0m \u001b[0mopener\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mopen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    217\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/urllib/request.py\u001b[0m in \u001b[0;36mopen\u001b[0;34m(self, fullurl, data, timeout)\u001b[0m\n\u001b[1;32m    524\u001b[0m             \u001b[0mmeth\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mprocessor\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 525\u001b[0;31m             \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mmeth\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    526\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/urllib/request.py\u001b[0m in \u001b[0;36mhttp_response\u001b[0;34m(self, request, response)\u001b[0m\n\u001b[1;32m    633\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0;36m200\u001b[0m \u001b[0;34m<=\u001b[0m \u001b[0mcode\u001b[0m \u001b[0;34m<\u001b[0m \u001b[0;36m300\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 634\u001b[0;31m             response = self.parent.error(\n\u001b[0m\u001b[1;32m    635\u001b[0m                 'http', request, response, code, msg, hdrs)\n","\u001b[0;32m/usr/lib/python3.10/urllib/request.py\u001b[0m in \u001b[0;36merror\u001b[0;34m(self, proto, *args)\u001b[0m\n\u001b[1;32m    562\u001b[0m             \u001b[0margs\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mdict\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'default'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'http_error_default'\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0morig_args\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 563\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_call_chain\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    564\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/urllib/request.py\u001b[0m in \u001b[0;36m_call_chain\u001b[0;34m(self, chain, kind, meth_name, *args)\u001b[0m\n\u001b[1;32m    495\u001b[0m             \u001b[0mfunc\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 496\u001b[0;31m             \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    497\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mresult\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/lib/python3.10/urllib/request.py\u001b[0m in \u001b[0;36mhttp_error_default\u001b[0;34m(self, req, fp, code, msg, hdrs)\u001b[0m\n\u001b[1;32m    642\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mhttp_error_default\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfp\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmsg\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhdrs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 643\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0mHTTPError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfull_url\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmsg\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhdrs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfp\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    644\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;31mHTTPError\u001b[0m: HTTP Error 400: Bad Request","\nDuring handling of the above exception, another exception occurred:\n","\u001b[0;31mQueryBadFormed\u001b[0m                            Traceback (most recent call last)","\u001b[0;32m/tmp/ipykernel_24068/1388559487.py\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m     41\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     42\u001b[0m \u001b[0mlu\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 43\u001b[0;31m \u001b[0;32mfor\u001b[0m \u001b[0ma\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mtraiteRequete\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrequete\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;36m10\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0ma_lire\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     44\u001b[0m   \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0ma\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     45\u001b[0m   \u001b[0mlu\u001b[0m \u001b[0;34m+=\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/tmp/ipykernel_24068/1388559487.py\u001b[0m in \u001b[0;36mtraiteRequete\u001b[0;34m(requete, N, M)\u001b[0m\n\u001b[1;32m     19\u001b[0m         \u001b[0;31m# Execute the query\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     20\u001b[0m         \u001b[0mDBPEDIA\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msetQuery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 21\u001b[0;31m         \u001b[0mresults\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mDBPEDIA\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconvert\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     22\u001b[0m         \u001b[0mresult_count\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mlen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mresults\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'results'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'bindings'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     23\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m~/.local/lib/python3.10/site-packages/SPARQLWrapper/SmartWrapper.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    344\u001b[0m         \u001b[0;34m:\u001b[0m\u001b[0mrtype\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0;34m:\u001b[0m\u001b[0;32mclass\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;31m`\u001b[0m\u001b[0mBindings\u001b[0m\u001b[0;31m`\u001b[0m \u001b[0minstance\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    345\u001b[0m         \"\"\"\n\u001b[0;32m--> 346\u001b[0;31m         \u001b[0mres\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msuper\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mSPARQLWrapper2\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    347\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    348\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mqueryType\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0mSELECT\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m~/.local/lib/python3.10/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    958\u001b[0m         \u001b[0;34m:\u001b[0m\u001b[0mrtype\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0;34m:\u001b[0m\u001b[0;32mclass\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;31m`\u001b[0m\u001b[0mQueryResult\u001b[0m\u001b[0;31m`\u001b[0m \u001b[0minstance\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    959\u001b[0m         \"\"\"\n\u001b[0;32m--> 960\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mQueryResult\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_query\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    961\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    962\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mqueryAndConvert\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m->\u001b[0m \u001b[0;34m\"QueryResult.ConvertResult\"\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m~/.local/lib/python3.10/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36m_query\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    928\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0murllib\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mHTTPError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    929\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcode\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m400\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 930\u001b[0;31m                 \u001b[0;32mraise\u001b[0m \u001b[0mQueryBadFormed\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    931\u001b[0m             \u001b[0;32melif\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcode\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m404\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    932\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0mEndPointNotFound\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;31mQueryBadFormed\u001b[0m: QueryBadFormed: A bad request has been sent to the endpoint: probably the SPARQL query is badly formed. \n\nResponse:\nb'Virtuoso 37000 Error SP030: SPARQL compiler, line 24: syntax error at \\'OFFSET\\' before \\'0\\'\\n\\nSPARQL query:\\ndefine sql:big-data-const 0\\n#output-format:application/sparql-results+json\\nDEFINE sql:describe-mode \"CBD\"\\n\\nPREFIX dc:   <http://purl.org/dc/terms/>\\nPREFIX xsd:  <http://www.w3.org/2001/XMLSchema#>\\n\\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\\nPREFIX rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\n\\nPREFIX dbo:  <http://dbpedia.org/ontology/>\\n\\n# Dans cette source, les noms de propri\\xc3\\xa9t\\xc3\\xa9s sont en fran\\xc3\\xa7ais\\nPREFIX dbp:  <http://fr.dbpedia.org/property/>\\n\\nSELECT distinct ?name ?p\\nWHERE {\\n  ?p rdf:type dbo:Person .\\n  ?p foaf:name ?name\\n  FILTER(  STRLEN(?name) != 0)\\n}\\nOFFSET 0 LIMIT 10\\n OFFSET 0 LIMIT 10'"]}],"source":["requete = DBPEDIA_prefix + \"\"\"\n","SELECT distinct ?name ?p\n","WHERE {\n","  ?p rdf:type dbo:Person .\n","  ?p foaf:name ?name\n","  FILTER(  STRLEN(?name) != 0)\n","}\n","OFFSET 0 LIMIT 10\n","\"\"\"\n","\n","# définition d'un générateur\n","def traiteRequete(requete, N, M):\n","    offset = 0\n","    total_read = 0\n","    while total_read < M:\n","        # Update the query with the current offset\n","        query = requete + f\" OFFSET {offset} LIMIT {N}\"\n","        \n","        # Execute the query\n","        DBPEDIA.setQuery(query)\n","        results = DBPEDIA.query().convert()\n","        result_count = len(results['results']['bindings'])\n","        \n","        # Yield each result\n","        for r in results['results']['bindings']:\n","            yield r\n","            total_read += 1\n","            if total_read >= M:\n","                break\n","                \n","        # If fewer results were returned than the limit, no need to continue\n","        if result_count < N:\n","            break\n","        \n","        # Update the offset for the next iteration\n","        offset += N\n","\n","\n","# Nombre de tuples que l'utilisateur souhaite lire\n","a_lire = 20\n","\n","lu = 0\n","for a in traiteRequete(requete, 10, a_lire):\n","  print(a)\n","  lu += 1\n","  if(lu >= a_lire):\n","    break\n","\n","print()\n","if(lu < a_lire):\n","  print(f\"Attention !!!! l'utilisateur n'a obtenu que {lu} lignes sur les {a_lire}\")\n","else:\n","  print(f\"OK, l'utilisateur a obtenu {lu} lignes sur les {a_lire}\")"]},{"cell_type":"markdown","metadata":{"id":"upK5LQIBkgnD"},"source":["3) Proposer une solution pour accéder de manière progressive au résultat d'une requête de jointure entre 2 sites, par exemple J1."]},{"cell_type":"code","execution_count":null,"metadata":{"id":"q3d3CmdPuI6b"},"outputs":[],"source":["# à compléter\n","\n","\n","# ! IMPORTANT\n","# # ! IMPORTANT\n","# # ! IMPORTANT\n","# # ! IMPORTANT\n","# # ! IMPORTANT\n","# # ! IMPORTANT\n","# # ! IMPORTANT\n","# # ! IMPORTANT\n","# # ! IMPORTANT# ! IMPORTANT\n","# # ! IMPORTANT\n","# # ! IMPORTANT\n","# # ! IMPORTANT\n","#  "]},{"cell_type":"markdown","metadata":{"id":"_a2Wt3ryG_ii"},"source":["# Exerice 4 : Cache de requêtes\n","1) Proposer des améliorations des requêtes précédentes afin d'éviter de poser plusieurs fois une même requête. On suppose que le résultat de la requête ne change pas entre deux invocations de la même requête.\n","\n","2) Cache avec une capacité limitée : considérer qu'on peut conserver en cache le résultat de C requêtes (C=10) au maximum"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"hcuUAhRWHg2a"},"outputs":[],"source":["# A compléter"]},{"cell_type":"markdown","metadata":{"id":"zo_g0AzJKVYF"},"source":["# FAQ: Questions diverses\n"]},{"cell_type":"markdown","metadata":{"id":"p4SmE1c7t_cZ"},"source":["## Mise au point des requêtes\n","Pour débugguer et **mettre au point vos requêtes** Sparql, il est utile de les tester directement sur l'interface du point d'accès dédié de la source de données. L'avantage est que cela vous retourne un message indiquant très précisément la nature et l'endroit où se trouve l'erreur dans la requête.\n","*   [BNF](http://data.bnf.fr/sparql) voir des [exemples](https://api.bnf.fr/sparql-endpoint-de-databnffr)\n","*   [DBPedia](http://fr.dbpedia.org/sparql) et la liste de tous les [prefixes](http://fr.dbpedia.org/sparql?nsdecl)\n"]},{"cell_type":"markdown","metadata":{"id":"5oiLbGDiPySC"},"source":["## Autres sources de données\n","Autres sources à votre disposition pour proposer des requêtes multi-sources:\n","\n","1.   [Mondial](http://www.semwebtech.org/mondial/10/sparql) : données géopolitiques. Attention le résulat des requêtes est en XML pas en JSON.\n","2.   [Persée](data.persee.fr) : données bibliographiques alignées avec plusieurs autres sources dont dbpedia. Voir des [exemples](http://data.persee.fr/ressources/requetes-exemples/)\n","3.   [BioPortal](http://sparql.bioontology.org)\n","4.    [IdRef](https://data.idref.fr/sparql) serveur d’autorité IdRef et les références bibliographiques en provenance du Sudoc.\n","5.   [Insee](https://rdf.insee.fr/sparql)\n","6.  [Geonames web services](https://www.geonames.org/export/ws-overview.html)\n"]},{"cell_type":"markdown","metadata":{"id":"VgX2uwT3QE1R"},"source":["## SPARKLIS : aide à l'écriture de requêtes Sparql\n","Pour exprimer vos requêtes en *langage naturel* et les traduire automatiquement en SPARQL, voir l'appli [Sparklis](http://www.irisa.fr/LIS/ferre/sparklis/)\n","\n","\n","*   onglet **Sparklis** pour exprimer vos requêtes en langage naturel\n","*   onglet **YASGUI** pour voir la traduction en Sparql\n","\n"]},{"cell_type":"markdown","metadata":{"id":"WmDBH2A6Ja0H"},"source":["## Nombre d'éléments dans le resultat d'une requête\n","Pour compter le nombre d'éléments d'une requête, utiliser la notation avec requête imbriquée dans le where :\n","\n","SELECT (count(1) as ?nb)\n","\n","WHERE { *sous-requete* }\n"]}],"metadata":{"colab":{"provenance":[{"file_id":"1tyNzBAtvH8YgrwhObWXEy72hItoDGFhX","timestamp":1711699842367}],"toc_visible":true},"kernelspec":{"display_name":"Python 3","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.10.12"}},"nbformat":4,"nbformat_minor":0}
